
<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft FrontPage 4.0">
<TITLE>Conceptos B&aacute;sicos de Probabilidad</TITLE>
<META NAME="ProgId" CONTENT="FrontPage.Editor.Document">
<META NAME="Template" CONTENT="C:\ARCHIVOS DE PROGRAMA\MICROSOFT OFFICE\OFFICE\html.dot">
<META HTTP-EQUIV="Content-Language" CONTENT="en-us">
<base target="_self">




</HEAD>
<BODY LINK="#000080" VLINK="#000080" topmargin="30" leftmargin="10" alink="#000080">

<TABLE CELLSPACING=0 BORDER=0 WIDTH=100%>
<TR>
<TD WIDTH="9" VALIGN="TOP" BGCOLOR="#ffffff" HEIGHT=1>
&nbsp;</TD>
<TD WIDTH="100%" VALIGN="TOP" BGCOLOR="#ffffff">
<h1><a NAME="SECTION00100000000000000000"><font size="3">Conceptos B&aacute;sicos de
Probabilidad</font></a></h1>
<p>La probabilidad es la rama de la matem&aacute;tica que estudia aquellos
experimentos cuyos resultados son aleatorios. Por esto entendemos experimentos
en los cuales los resultados pueden variar entre una y otra ejecuci&oacute;n.
<p>Para que un experimento sea aleatorio debe presentar dos caracter&iacute;sticas
importantes, la primera de ellas tiene que ver con la posibilidad de determinar
un conjunto, <em>espacio muestral,</em> que re&uacute;na todos los posibles resultados
que puede tener; la segunda tiene que ver con la imposibilidad de que los
resultados de repeticiones tengan un comportamiento igual o predecible.
<p>Cuando se tiene un experimento probabil&iacute;stico, cualquier subconjunto del
espacio muestral recibe el nombre de <em>evento</em>.
<p>Es com&uacute;n encontrar en la literatura dos conceptos algo diferentes acerca de
lo que es la probabilidad. Uno de estos conceptos, la <em>probabilidad estad&iacute;stica,</em>
tiende a ver la probabilidad como la frecuencia relativa con que ocurre un
evento si un experimento se repite una cantidad grande de veces.
<p>En el otro enfoque, <em>probabilidad inductiva,</em> la probabilidad tiende a
verse como el grado de credibilidad que es razonable asignarle a una proposici&oacute;n
que describe a un evento, de acuerdo a una evidencia dada.
<p>La probabilidad estad&iacute;stica se fundamenta fuertemente en la estabilidad del
cociente entre las ocurrencias del evento y el total de ejecuciones del
experimento cuando este total de ejecuciones es grande, de hecho es un valor l&iacute;mite
de ese cociente.
<p>Es importante recalcar que éste es esencialmente un concepto emp&iacute;rico,
mediante el cual se hacen aseveraciones de qué ocurre en el mundo real basadas
en la observaci&oacute;n y en la experimentaci&oacute;n. También, en este tipo de
probabilidad nunca se podr&aacute; conocer con exactitud el valor de la probabilidad
de un evento, pues en la pr&aacute;ctica ning&uacute;n experimento puede repetirse
indefinidamente.
<p>Dada esta deficiencia insinuada de este tipo de probabilidad podr&iacute;a pensarse
que es inv&aacute;lida o carente de importancia; no obstante esta dificultad de
definir <em>adecuadamente </em>la probabilidad estad&iacute;stica no difiere de la
dificultad de definir otros conceptos importantes como el tiempo y no es una
limitaci&oacute;n de peso para usar el concepto cuyo significado es intuitivamente
claro.
<p>La probabilidad inductiva tiene un car&aacute;cter que no es emp&iacute;rico,&nbsp; pues
en ésta se busca conocer el grado de certidumbre que uno puede asignarle a una
hip&oacute;tesis acorde a una evidencia; para hacer esto uno debe pensar en el
problema a la luz de las evidencias; si éstas cambian, también podr&iacute;a hacerlo
la probabilidad asignada.
<p>La diferencia esencial entre ambos conceptos es que la probabilidad estad&iacute;stica
es un concepto emp&iacute;rico mientras que la probabilidad inductiva es un concepto l&oacute;gico.
<p>Al margen de estas distinciones es dif&iacute;cil establecer fronteras acerca de d&oacute;nde
usar una y d&oacute;nde la otra. Por ejemplo si uno quiere saber si una moneda no est&aacute;
cargada, podr&iacute;a lanzarla al aire una gran cantidad de veces y verificar que la
raz&oacute;n de escudos es 1/2; en este caso estamos usando el sentido estad&iacute;stico de
la probabilidad. Sin embargo si se lanza la moneda 100 veces y cae 48 veces
escudo, uno podr&iacute;a preguntarse si hay una buena evidencia de que la moneda no
est&aacute; cargada. En ese caso estar&iacute;amos entrando en el sentido inductivo de la
probabilidad; y una respuesta aceptable puede ser que: hay una alta probabilidad
(en sentido inductivo), de que la probabilidad de escudo (en el sentido estad&iacute;stico)
es de 1/2.
<p>Aunque el estudio de las probabilidades se asocia usualmente con juegos de
azar, este pensamiento est&aacute; bastante lejos de ser real, pues si bien muchas de
las aplicaciones iniciales de la probabilidad estuvieron ligadas con el estudio
organizado y sistem&aacute;tico de resultados de juegos de azar [<a HREF="node43.html#Feller">6</a>],
lo cierto es que hoy d&iacute;a el estudio de las probabilidades invade pr&aacute;cticamente
todos los &aacute;mbitos de la ciencias.
<p>La probabilidad se utiliza en el planteo y soluci&oacute;n de diversos problemas
que tienen que ver con industria, administraci&oacute;n, computaci&oacute;n, y otras &aacute;reas
del desarrollo cient&iacute;fico.
<p>En general los resultados obtenidos en experimentos aleatorios no son
determin&iacute;sticos pero el estudio probabil&iacute;stico de fen&oacute;menos aleatorios
permiten planteamientos m&aacute;s cient&iacute;ficos y organizados para la soluci&oacute;n de
problemas. De hecho muchas de las mediciones sobre las que se fundamenta la
ciencia no son exactas. Por ejemplo el tiempo que transcurre entre la llegada de
un cliente a la cola de la caja de un banco y el momento en que se inicia su
atenci&oacute;n, o la medida que obtiene una persona al utilizar una cinta métrica
para determinar la longitud de un trozo de metal, la longitud de un tornillo que
se produce por una m&aacute;quina, la resistencia de una viga etc.
<p>Mas a&uacute;n, muchos problemas aunque se planteen y resuelvan como determin&iacute;sticos
no lo son, en realidad son probabil&iacute;sticos. Si un componente debe programarse
para controlar el llenado de botellas de refresco, de manera tal que cada
botella lleve 500 ml de l&iacute;quido, usualmente no es posible la exactitud en el
proceso de llenado, s&oacute;lo se logra que en promedio cada botella contenga 500 ml
pero algunas tendr&aacute;n m&aacute;s y otras menos.
<p>En este curso nos dedicaremos al estudio b&aacute;sico de las probabilidades, ser&aacute;
la pr&aacute;ctica discutir los resultados y brindar justificaciones, formales en unos
casos e intuitivas en otros. El lector interesado en profundizar alguno de los
temas puede consultar la bibliograf&iacute;a.
<p>&nbsp;</TD>
</TR>
</TABLE>
  

<p>&nbsp;</p>
<p>&nbsp;</p>

</BODY>
</HTML>
