{
  "fundamentos-de-matematica-2025": {
    "coverImage": "/libros/universitaria/analisis/fundamentos-de-matematica-2025/portada.webp",
    "title": "Fundamentos de Matemática I: Compilación de Teoría y Ejercicios",
    "title_en": "Foundations of Mathematics I: Compilation of Theory and Exercises",
    "title_pt": "Fundamentos de Matemática I: Compilação de Teoria e Exercícios",
    "authors": [
      {
        "name": "Reiman Acuña Chacón",
        "email": "reiacuna@itcr.ac.cr",
        "orcid": "https://orcid.org/0000-0002-0094-3282",
        "university": "Instituto Tecnológico de Costa Rica",
        "location": "Cartago, Costa Rica"
      },
      {
        "name": "Alcides Astorga Morales",
        "email": "",
        "orcid": "",
        "university": "Instituto Tecnológico de Costa Rica",
        "location": "Cartago, Costa Rica"
      },
      {
        "name": "Jeffrey Chavarría Molina",
        "email": "jchavarria@itcr.ac.cr",
        "orcid": "https://orcid.org/0000-0002-8943-4475",
        "university": "Instituto Tecnológico de Costa Rica",
        "location": "Cartago, Costa Rica"
      },
      {
        "name": "Marco Gutiérrez Montenegro",
        "email": "vgutierrez@itcr.ac.cr",
        "orcid": "https://orcid.org/0009-0004-0293-1578",
        "university": "Instituto Tecnológico de Costa Rica",
        "location": "Cartago, Costa Rica"
      },
      {
        "name": "Edwin Quesada Solano",
        "email": "edquesada1993@gmail.com",
        "orcid": "https://orcid.org/0009-0005-3801-2079",
        "university": "Instituto Tecnológico de Costa Rica",
        "location": "Cartago, Costa Rica"
      },
      {
        "name": "Greivin Ramírez Arce",
        "email": "gramirez@itcr.ac.cr",
        "orcid": "https://orcid.org/0000-0002-3731-5415",
        "university": "Instituto Tecnológico de Costa Rica",
        "location": "Cartago, Costa Rica"
      },
      {
        "name": "Bryan Ramírez Obando",
        "email": "bramirez9122@gmail.com",
        "orcid": "https://orcid.org/0009-0008-0340-6096",
        "university": "Instituto Tecnológico de Costa Rica",
        "location": "Cartago, Costa Rica"
      },
      {
        "name": "Natalia Rodríguez Granados",
        "email": "nrodriguez@itcr.ac.cr",
        "orcid": "https://orcid.org/0000-0002-5566-0861",
        "university": "Instituto Tecnológico de Costa Rica",
        "location": "Cartago, Costa Rica"
      },
      {
        "name": "Giovanni Sanabria Brenes",
        "email": "gsanabria@itcr.ac.cr",
        "orcid": "https://orcid.org/0000-0002-7045-0600",
        "university": "Instituto Tecnológico de Costa Rica",
        "location": "Cartago, Costa Rica"
      }
    ],
    "lastRevision": "Agosto 2025",
    "category": "universitaria",
    "pdf": "/libros/universitaria/analisis/fundamentos-de-matematica-2025/libro.pdf",
    "received": "30 de setiembre de 2023",
    "accepted": "27 de mayo de 2025",
    "abstract_es": "Este libro está dedicado a los fundamentos de la matemática, una disciplina que no solo subyace en el corazón de todas las ciencias naturales, sino que también constituye la base de nuestro razonamiento lógico cotidiano. A lo largo de estas páginas, se realiza una exploración rigurosa de conceptos esenciales como las demostraciones de implicaciones, el conjunto de los números reales, el conjunto de los números complejos y el tratamiento de expresiones y ecuaciones algebraicas. Nuestro objetivo es proporcionar una introducción accesible a estos temas, garantizando que el lector desarrolle una comprensión profunda y un aprecio por la estructura lógica de la matemática. Cada capítulo ha sido cuidadosamente estructurado para ofrecer una exposición progresiva de los temas, acompañada de ejemplos que ilustran tanto las aplicaciones prácticas como las teóricas de los conceptos tratados. Este texto está diseñado tanto para estudiantes que se inician en los estudios matemáticos como para aquellos que desean consolidar y profundizar sus conocimientos. Se han incluido ejercicios diseñados para que el lector aplique lo aprendido, promoviendo así un aprendizaje activo y reflexivo. Confiamos en que este libro se convertirá en un recurso valioso para entender los principios fundamentales del pensamiento matemático y en una herramienta esencial para quienes se dedican al estudio serio de esta disciplina.",
    "keywords_es": ["Fundamentos de Matemática"],
    "abstract_en": "This book is devoted to the fundamentals of mathematics—a discipline that not only underpins all the natural sciences but also forms the foundation of everyday logical reasoning. Within these pages, we explore essential concepts with rigor, including the demonstration of implications, the structure of the real and complex number systems, and the manipulation of algebraic expressions and equations. Our goal is to offer an accessible introduction to these topics, helping readers develop a solid understanding and appreciation of the logical framework that defines mathematics. Each chapter is carefully organized to present topics progressively, supported by examples that highlight both practical and theoretical aspects of the material. This text is intended for students beginning their mathematical journey, as well as for those seeking to strengthen and expand their foundational knowledge. A variety of exercises are included to encourage active engagement with the material and foster reflective learning. We are confident that this book will serve as a valuable resource for anyone looking to understand the core principles of mathematical thought—and as an essential companion for the serious study of the subject.",
    "keywords_en": ["Foundations of Mathematics"],
    "abstract_pt": "Este livro é dedicado aos fundamentos da matemática, uma disciplina que não apenas sustenta todas as ciências naturais, mas também constitui a base do nosso raciocínio lógico cotidiano. Ao longo destas páginas, realiza-se uma exploração rigorosa de conceitos essenciais, como as demonstrações de implicações, o conjunto dos números reais, o conjunto dos números complexos e o tratamento de expressões e equações algébricas. Nosso objetivo é oferecer uma introdução acessível a esses temas, garantindo que o leitor desenvolva uma compreensão profunda e uma apreciação pela estrutura lógica da matemática. Cada capítulo foi cuidadosamente estruturado para oferecer uma exposição progressiva dos temas, acompanhada de exemplos que ilustram tanto as aplicações práticas quanto os aspectos teóricos dos conceitos tratados. Este texto foi projetado tanto para estudantes que estão iniciando seus estudos matemáticos quanto para aqueles que desejam consolidar e aprofundar seus conhecimentos. Foram incluídos exercícios projetados para que o leitor aplique o que aprendeu, promovendo assim uma aprendizagem ativa e reflexiva. Estamos confiantes de que este livro se tornará um recurso valioso para compreender os princípios fundamentais do pensamento matemático e uma ferramenta essencial para quem se dedica ao estudo sério desta disciplina.",
    "keywords_pt": ["Fundamentos de Matemática"],
    "citation": "Acuña Chacón, R., Astorga Morales, A., Chavarría Molina, J., Gutiérrez Montenegro, M., Quesada Solano, E., Ramírez Arce, G., Ramírez Obando, B., Rodríguez Granados, N., & Sanabria Brenes, G. (s.f.). Fundamentos de Matemática I. Revista Digital: Matemática, Educación e Internet, 26(1). Recuperado de https://tecdigital.tec.ac.cr/servicios/revistamatematica/libros/fundamentos-de-matematica-2025/"
  },
  "latex-2021": {
    "coverImage": "/libros/universitaria/otros/latex-2021/portada.webp",
    "title": "Edición de textos científicos con LaTeX. Composición, gráficos, diseño editorial y presentaciones beamer",
    "title_en": "Scientific Text Editing with LaTeX: Composition, Graphics, Editorial Design and Beamer Presentations",
    "authors": [
      {
        "name": "Walter Mora Flores",
        "email": "wmoraz@itcr.ac.cr",
        "orcid": "https://orcid.org/0009-0008-8770-3417",
        "university": "Instituto Tecnológico de Costa Rica, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "Alexander Borbón A.",
        "email": "aborbon@itcr.ac.cr",
        "orcid": "https://orcid.org/0009-0006-4455-9414",
        "university": "Instituto Tecnológico de Costa Rica, Escuela de Matemática",
        "location": "Costa Rica"
      }
    ],
    "lastRevision": "Enero 2021",
    "category": "universitaria ",
    "pdf": "/libros/universitaria/otros/latex-2021/libro.pdf",
    "abstract_es": "Este texto aborda aspectos fundamentales e intermedios de la composición tipográfica con LaTeX, el diseño editorial y la creación de presentaciones con Beamer. Incluye también la edición de gráficos mediante Inkscape y TikZ, así como el uso de entornos avanzados con los paquetes xparse y tcolorbox. Se presentan ejemplos prácticos, plantillas y explicaciones que facilitan la comprensión y aplicación de los conceptos en la elaboración de documentos técnicos y académicos. El libro reúne los temas más comunes en la edición de textos científicos, especialmente en matemáticas, educación y programación, e incorpora actualizaciones sobre nuevos paquetes y técnicas de diseño editorial.",
    "keywords_es": ["LaTeX", "diseño editorial", "Beamer", "TikZ", "tcolorbox"],

    "abstract_en": "This text covers fundamental and intermediate aspects of typesetting with LaTeX, editorial design, and the creation of presentations using Beamer. It also includes the editing of graphics with Inkscape and TikZ, as well as the use of advanced environments with the xparse and tcolorbox packages. Practical examples, templates, and explanations are provided to facilitate understanding and application of concepts in the production of technical and academic documents. The book gathers the most common topics in scientific text editing, particularly in mathematics, education, and programming, and incorporates updates on new packages and editorial design techniques.",
    "keywords_en": ["LaTeX", "editorial design", "Beamer", "TikZ", "tcolorbox"],

    "abstract_pt": "Este texto aborda aspectos fundamentais e intermediários da composição tipográfica com LaTeX, do design editorial e da criação de apresentações com Beamer. Também inclui a edição de gráficos com Inkscape e TikZ, além do uso de ambientes avançados com os pacotes xparse e tcolorbox. São apresentados exemplos práticos, modelos e explicações que facilitam a compreensão e a aplicação dos conceitos na elaboração de documentos técnicos e acadêmicos. O livro reúne os temas mais comuns na edição de textos científicos, especialmente em matemática, educação e programação, e incorpora atualizações sobre novos pacotes e técnicas de design editorial.",
    "keywords_pt": ["LaTeX", "design editorial", "Beamer", "TikZ", "tcolorbox"],

    "citation": "Mora Flores, W.A., & Borbón A., A. (2021). LaTeX. Revista digital Matemática, Educación e Internet, 23(2). Recuperado de: https://tecdigital.tec.ac.cr/servicios/revistamatematica/libros/latex-2021/"
  },
  "matematica-discreta-2018": {
    "coverImage": "/libros/universitaria/algebra/matematica-discreta-2018/portada.webp",
    "title": "Matemática discreta a través del uso del Paquete Vilcretas",
    "title_en": "Discrete Mathematics through the Use of the Vilcretas Package",
    "authors": [
      {
        "name": "Enrique Vílchez Q.",
        "email": "enrique.vilchez.quesada@una.cr",
        "orcid": "https://orcid.org/0000-0002-2571-5729",
        "university": "Universidad Nacional de Costa Rica",
        "location": "Costa Rica"
      }
    ],
    "lastRevision": "Mayo 2018",
    "category": "universitaria ",
    "pdf": "/libros/universitaria/algebra/matematica-discreta-2018/libro.pdf",
    "abstract_es": "Este texto presenta los fundamentos de la matemática discreta, abordando temas esenciales como los conjuntos, las relaciones, las funciones y la combinatoria. Incluye además contenidos sobre teoría de grafos, inducción matemática y técnicas de conteo, con ejemplos y ejercicios diseñados para fortalecer la comprensión conceptual y el razonamiento matemático. El libro busca ofrecer una base sólida para el estudio de la matemática discreta y sus aplicaciones en la informática, la ingeniería y otras ciencias afines.",
    "keywords_es": [
      "matemática discreta",
      "combinatoria",
      "teoría de grafos",
      "inducción matemática"
    ],

    "abstract_en": "This text presents the fundamentals of discrete mathematics, covering essential topics such as sets, relations, functions, and combinatorics. It also includes content on graph theory, mathematical induction, and counting techniques, with examples and exercises designed to strengthen conceptual understanding and mathematical reasoning. The book aims to provide a solid foundation for the study of discrete mathematics and its applications in computer science, engineering, and related fields.",
    "keywords_en": [
      "discrete mathematics",
      "combinatorics",
      "graph theory",
      "mathematical induction"
    ],

    "abstract_pt": "Este texto apresenta os fundamentos da matemática discreta, abordando temas essenciais como conjuntos, relações, funções e combinatória. Também inclui conteúdos sobre teoria dos grafos, indução matemática e técnicas de contagem, com exemplos e exercícios elaborados para fortalecer a compreensão conceitual e o raciocínio matemático. O livro busca oferecer uma base sólida para o estudo da matemática discreta e suas aplicações na informática, engenharia e outras ciências afins.",
    "keywords_pt": [
      "matemática discreta",
      "combinatória",
      "teoria dos grafos",
      "indução matemática"
    ],
    "citation": "Vílchez Q., E. (2018). Matemática Discreta. Revista digital Matemática, Educación e Internet, 20(2). Recuperado de: https://tecdigital.tec.ac.cr/servicios/revistamatematica/libros/matematica-discreta-2018/"
  },
  "calculo-diferencial-e-integral-2017": {
    "coverImage": "/libros/universitaria/analisis/calculo-diferencial-e-integral-2017/portada.webp",
    "title": "Cálculo Diferencial e Integral con Aplicaciones",
    "title_en": "Differential and Integral Calculus with Applications",
    "authors": [
      {
        "name": "Elsie Hernández S.",
        "university": "Instituto Tecnológico de Costa Rica, Escuela de Matemática",
        "location": "Costa Rica"
      }
    ],
    "lastRevision": "2017",
    "category": "universitaria ",
    "pdf": "/libros/universitaria/analisis/calculo-diferencial-e-integral-2017/libro.pdf",
    "abstract_es": "Este texto aborda los principios fundamentales del cálculo diferencial e integral, presentando de forma clara y progresiva los conceptos de límite, derivada, integral y sus aplicaciones prácticas. A través de explicaciones detalladas, ejemplos resueltos y ejercicios, se busca fortalecer la comprensión conceptual y la habilidad para aplicar el cálculo en la resolución de problemas reales en ciencias e ingeniería. Además, se incluyen secciones dedicadas a la interpretación geométrica y física de los resultados, promoviendo una visión integral del análisis matemático.",
    "keywords_es": [
      "cálculo diferencial",
      "cálculo integral",
      "límites",
      "derivadas",
      "integrales definidas",
      "aplicaciones del cálculo"
    ],

    "abstract_en": "This book addresses the fundamental principles of differential and integral calculus, presenting in a clear and progressive way the concepts of limit, derivative, integral, and their practical applications. Through detailed explanations, solved examples, and exercises, it aims to strengthen conceptual understanding and the ability to apply calculus in solving real-world problems in science and engineering. It also includes sections dedicated to the geometric and physical interpretation of results, promoting an integrated view of mathematical analysis.",
    "keywords_en": [
      "differential calculus",
      "integral calculus",
      "limits",
      "derivatives",
      "definite integrals",
      "applications of calculus"
    ],

    "abstract_pt": "Este texto aborda os princípios fundamentais do cálculo diferencial e integral, apresentando de forma clara e progressiva os conceitos de limite, derivada, integral e suas aplicações práticas. Por meio de explicações detalhadas, exemplos resolvidos e exercícios, busca-se fortalecer a compreensão conceitual e a habilidade de aplicar o cálculo na resolução de problemas reais em ciências e engenharia. Além disso, incluem-se seções dedicadas à interpretação geométrica e física dos resultados, promovendo uma visão integrada da análise matemática.",
    "keywords_pt": [
      "cálculo diferencial",
      "cálculo integral",
      "limites",
      "derivadas",
      "integrais definidas",
      "aplicações do cálculo"
    ],

    "citation": "Hernández S., E. (2017). Cálculo Diferencial e Integral con Aplicaciones. Revista digital Matemática, Educación e Internet, 18(2). Recuperado de: https://tecdigital.tec.ac.cr/servicios/revistamatematica/libros/calculo-diferencial-e-integral-2017/"
  },
  "metodos-numericos-2015": {
    "coverImage": "/libros/universitaria/analisis/metodos-numericos-2015/portada.webp",
    "title": "Métodos Numéricos con Basic Calc de LibreOffice y WxMaxima",
    "title_en": "Numerical Methods with LibreOffice Basic Calc and WxMaxima",
    "authors": [
      {
        "name": "Walter Mora Flores",
        "email": "wmoraz@itcr.ac.cr",
        "orcid": "https://orcid.org/0009-0008-8770-3417",
        "university": "Instituto Tecnológico de Costa Rica, Escuela de Matemática",
        "location": "Costa Rica"
      }
    ],
    "lastRevision": "2015",
    "category": "universitaria ",
    "pdf": "/libros/universitaria/analisis/metodos-numericos-2015/libro.pdf",
    "abstract_es": "Este libro presenta una introducción práctica a los métodos numéricos utilizando el lenguaje R, particularmente mediante el entorno RStudio. Se inicia con una guía detallada sobre la instalación, configuración y uso del programa, incluyendo la edición de scripts, la ejecución de código y la generación de reportes. Posteriormente, se abordan los fundamentos del lenguaje R: variables, funciones, vectores, matrices, arreglos, estructuras de control y el uso de paquetes especializados como pracma y matrix. En la segunda parte, se desarrollan los principios teóricos y computacionales de los métodos numéricos, incluyendo el análisis de errores, los polinomios de Taylor, la solución de ecuaciones no lineales mediante métodos iterativos (bisección, punto fijo, Newton, secante y Brent), la resolución de sistemas de ecuaciones lineales, la interpolación polinomial, la derivación e integración numérica y la aproximación de soluciones de ecuaciones diferenciales ordinarias. El texto combina teoría y práctica con ejemplos y ejercicios implementados en R, enfatizando la comprensión algorítmica y la validación numérica de los resultados.",
    "keywords_es": [
      "métodos numéricos",
      "RStudio",
      "análisis de errores",
      "ecuaciones no lineales",
      "interpolación polinomial",
      "integración numérica"
    ],

    "abstract_en": "This book offers a practical introduction to numerical methods using the R language, particularly through the RStudio environment. It begins with a detailed guide to installing, configuring, and using the program, including script editing, code execution, and report generation. It then covers the fundamentals of the R language: variables, functions, vectors, matrices, arrays, control structures, and the use of specialized packages such as pracma and matrix. The second part develops the theoretical and computational principles of numerical methods, including error analysis, Taylor polynomials, the solution of nonlinear equations through iterative methods (bisection, fixed point, Newton, secant, and Brent), the solution of linear systems, polynomial interpolation, numerical differentiation and integration, and the approximation of ordinary differential equations. The text combines theory and practice with examples and exercises implemented in R, emphasizing algorithmic understanding and numerical validation of results.",
    "keywords_en": [
      "numerical methods",
      "RStudio",
      "error analysis",
      "nonlinear equations",
      "polynomial interpolation",
      "numerical integration"
    ],

    "abstract_pt": "Este livro apresenta uma introdução prática aos métodos numéricos utilizando a linguagem R, especialmente por meio do ambiente RStudio. Inicia-se com um guia detalhado sobre a instalação, configuração e uso do programa, incluindo a edição de scripts, a execução de código e a geração de relatórios. Em seguida, abordam-se os fundamentos da linguagem R: variáveis, funções, vetores, matrizes, arranjos, estruturas de controle e o uso de pacotes especializados como pracma e matrix. Na segunda parte, desenvolvem-se os princípios teóricos e computacionais dos métodos numéricos, incluindo a análise de erros, os polinômios de Taylor, a solução de equações não lineares por métodos iterativos (bisseção, ponto fixo, Newton, secante e Brent), a resolução de sistemas lineares, a interpolação polinomial, a derivação e integração numérica e a aproximação de soluções de equações diferenciais ordinárias. O texto combina teoria e prática com exemplos e exercícios implementados em R, enfatizando a compreensão algorítmica e a validação numérica dos resultados.",
    "keywords_pt": [
      "métodos numéricos",
      "RStudio",
      "análise de erros",
      "equações não lineares",
      "interpolação polinomial",
      "integração numérica"
    ],

    "citation": "Mora F., W. A. (2015). Métodos Numéricos con Basic Calc de LibreOffice y WxMaxima. Revista digital Matemática, Educación e Internet, 16(2). Recuperado de: https://tecdigital.tec.ac.cr/servicios/revistamatematica/libros/metodos-numericos-2015/"
  },
  "matrices-sistemas-lineales-2013": {
    "coverImage": "/libros/universitaria/algebra/matrices-y-sistemas-lineales-2013/portada.webp",
    "title": "Matrices y Sistemas Lineales",
    "title_en": "Matrices and Linear Systems",
    "authors": [
      {
        "name": "Christian Páez",
        "email": "cpaez@itcr.ac.cr",
        "orcid": "https://orcid.org/0009-0008-5651-4699",
        "university": "Instituto Tecnológico de Costa Rica, Escuela de Matemática",
        "location": "Costa Rica"
      }
    ],
    "lastRevision": "2013",
    "category": "universitaria ",
    "pdf": "/libros/universitaria/algebra/matrices-y-sistemas-lineales-2013/libro.pdf",
    "abstract_es": "Este texto introduce los conceptos fundamentales de las matrices y su aplicación en la resolución de sistemas lineales. Se abordan operaciones básicas con matrices, determinantes, matrices inversas, y propiedades esenciales del álgebra matricial. Asimismo, se analizan distintos métodos para resolver sistemas de ecuaciones lineales, incluyendo los métodos de Gauss, Gauss-Jordan y la regla de Cramer, junto con una discusión sobre la existencia y unicidad de soluciones. El enfoque del libro combina la teoría con ejemplos prácticos que facilitan la comprensión de los procedimientos algebraicos y su relevancia en la modelización de problemas en ingeniería, ciencias y matemáticas aplicadas.",
    "keywords_es": [
      "matrices",
      "sistemas lineales",
      "álgebra matricial",
      "método de Gauss",
      "determinantes"
    ],

    "abstract_en": "This text introduces the fundamental concepts of matrices and their application in solving linear systems. It covers basic matrix operations, determinants, inverse matrices, and key properties of matrix algebra. It also discusses various methods for solving systems of linear equations, including the Gauss, Gauss-Jordan, and Cramer’s rule methods, along with a discussion on the existence and uniqueness of solutions. The book combines theory with practical examples to enhance the understanding of algebraic procedures and their relevance in modeling problems in engineering, science, and applied mathematics.",
    "keywords_en": [
      "matrices",
      "linear systems",
      "matrix algebra",
      "Gauss method",
      "determinants"
    ],

    "abstract_pt": "Este texto introduz os conceitos fundamentais das matrizes e sua aplicação na resolução de sistemas lineares. São abordadas operações básicas com matrizes, determinantes, matrizes inversas e propriedades essenciais da álgebra matricial. Também são analisados diversos métodos para resolver sistemas de equações lineares, incluindo os métodos de Gauss, Gauss-Jordan e a regra de Cramer, juntamente com uma discussão sobre a existência e unicidade das soluções. O livro combina teoria e exemplos práticos para facilitar a compreensão dos procedimentos algébricos e sua relevância na modelagem de problemas em engenharia, ciências e matemática aplicada.",
    "keywords_pt": [
      "matrizes",
      "sistemas lineares",
      "álgebra matricial",
      "método de Gauss",
      "determinantes"
    ],

    "citation": "Páez P., C. (2013). Matrices y Sistemas Lineales. Revista digital Matemática, Educación e Internet, 14(2). Recuperado de: https://tecdigital.tec.ac.cr/servicios/revistamatematica/libros/matrices-y-sistemas-lineales-2013/"
  },
  "teoria-de-numeros-2014": {
    "coverImage": "/libros/universitaria/algebra/teoria-de-numeros-2014/portada.webp",
    "title": "Introducción a la teoría de números. Ejemplos y Algoritmos",
    "title_en": "Introduction to Number Theory: Examples and Algorithms",
    "authors": [
      {
        "name": "Walter Mora Flores",
        "email": "wmoraz@itcr.ac.cr",
        "orcid": "https://orcid.org/0009-0008-8770-3417",
        "university": "Instituto Tecnológico de Costa Rica, Escuela de Matemática",
        "location": "Costa Rica"
      }
    ],
    "lastRevision": "2014",
    "category": "universitaria ",
    "pdf": "/libros/universitaria/algebra/teoria-de-numeros-2014/libro.pdf",
    "abstract_es": "Este libro introduce los conceptos fundamentales de la teoría de números desde una perspectiva elemental y algorítmica. Se abordan temas como divisibilidad, números primos, el máximo común divisor, el algoritmo de Euclides y sus extensiones, junto con la factorización y la aritmética modular. Además, se incluyen tópicos sobre congruencias, sistemas de ecuaciones diofánticas, funciones aritméticas y teoremas clásicos como los de Fermat, Euler y Wilson. El texto destaca por su enfoque práctico, presentando ejemplos desarrollados paso a paso y algoritmos implementables que facilitan la comprensión de los conceptos y su aplicación en la resolución de problemas.",
    "keywords_es": [
      "teoría de números",
      "divisibilidad",
      "congruencias",
      "números primos",
      "algoritmo de Euclides",
      "aritmética modular"
    ],
    "abstract_en": "This book introduces the fundamental concepts of number theory from an elementary and algorithmic perspective. It covers topics such as divisibility, prime numbers, the greatest common divisor, the Euclidean algorithm and its extensions, together with factorization and modular arithmetic. Additional topics include congruences, systems of Diophantine equations, arithmetic functions, and classical theorems such as those of Fermat, Euler, and Wilson. The text emphasizes a practical approach, presenting step-by-step examples and implementable algorithms that facilitate the understanding and application of number theory concepts in problem solving.",
    "keywords_en": [
      "number theory",
      "divisibility",
      "congruences",
      "prime numbers",
      "Euclidean algorithm",
      "modular arithmetic"
    ],

    "abstract_pt": "Este livro introduz os conceitos fundamentais da teoria dos números a partir de uma perspectiva elementar e algorítmica. São abordados temas como divisibilidade, números primos, o máximo divisor comum, o algoritmo de Euclides e suas extensões, juntamente com fatoração e aritmética modular. Além disso, incluem-se tópicos sobre congruências, sistemas de equações diofantinas, funções aritméticas e teoremas clássicos como os de Fermat, Euler e Wilson. O texto destaca-se pela abordagem prática, apresentando exemplos desenvolvidos passo a passo e algoritmos implementáveis que facilitam a compreensão dos conceitos e sua aplicação na resolução de problemas.",
    "keywords_pt": [
      "teoria dos números",
      "divisibilidade",
      "congruências",
      "números primos",
      "algoritmo de Euclides",
      "aritmética modular"
    ],

    "citation": "Mora Flores, W. (2014). Introducción a la teoría de números. Ejemplos y Algoritmos. Revista digital Matemática, Educación e Internet, 15(2). Recuperado de: https://tecdigital.tec.ac.cr/servicios/revistamatematica/libros/teoria-de-numeros-2014/"
  },
  "edepa-2013": {
    "coverImage": "/libros/universitaria/estadistica/edepa-2013/portada.webp",
    "title": "Encuentro sobre Didáctica de la Estadística, la Probabilidad y el Análisis de Datos (EDEPA)",
    "title_en": "Meeting on the Didactics of Statistics, Probability and Data Analysis (EDEPA)",
    "authors": [
      {
        "name": "Walter Mora Flores",
        "email": "wmoraz@itcr.ac.cr",
        "orcid": "https://orcid.org/0009-0008-8770-3417",
        "university": "Instituto Tecnológico de Costa Rica, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "Greivin Ramírez Arce",
        "email": "gramirez@itcr.ac.cr",
        "orcid": "https://orcid.org/0000-0002-3731-5415",
        "university": "Instituto Tecnológico de Costa Rica",
        "location": "Cartago, Costa Rica"
      }
    ],
    "lastRevision": "2013",
    "category": "congreso",
    "pdf": "/libros/universitaria/estadistica/edepa-2013/libro.pdf",
    "abstract_es": "El Encuentro sobre Didáctica de la Estadística, la Probabilidad y el Análisis de Datos (EDEPA) es una iniciativa del Instituto Tecnológico de Costa Rica (ITCR) que reúne a profesionales y docentes de distintos niveles educativos, tanto nacionales como internacionales, con el propósito de reflexionar sobre la enseñanza de la estadística, la probabilidad y el análisis de datos. Este volumen presenta una selección de contribuciones del II EDEPA, realizado en noviembre de 2011, así como trabajos derivados de la I Escuela de Verano EDEPA celebrada en diciembre de 2012. Los contenidos se organizan en tres secciones principales: didáctica, aplicaciones y uso de software, ofreciendo perspectivas diversas sobre estrategias pedagógicas, experiencias de aula e integración de herramientas tecnológicas. La obra busca fortalecer la alfabetización estadística y el pensamiento probabilístico, promoviendo la innovación y el intercambio académico en el ámbito de la educación matemática.",

    "keywords_es": [
      "didáctica de la estadística",
      "probabilidad",
      "análisis de datos",
      "educación matemática",
      "uso de software",
      "innovación pedagógica"
    ],

    "abstract_en": "The Meeting on the Didactics of Statistics, Probability, and Data Analysis (EDEPA) is an initiative of the Costa Rica Institute of Technology (ITCR) that brings together professionals and educators from various educational levels, both national and international, to reflect on the teaching of statistics, probability, and data analysis. This volume includes a selection of contributions from the second EDEPA, held in November 2011, as well as works derived from the first EDEPA Summer School, held in December 2012. The contents are organized into three main sections: didactics, applications, and software use, providing diverse perspectives on pedagogical strategies, classroom experiences, and the integration of technological tools. The book aims to strengthen statistical literacy and probabilistic thinking while promoting innovation and academic exchange in mathematics education.",

    "keywords_en": [
      "statistics education",
      "probability",
      "data analysis",
      "mathematics education",
      "software use",
      "pedagogical innovation"
    ],

    "abstract_pt": "O Encontro sobre Didática da Estatística, da Probabilidade e da Análise de Dados (EDEPA) é uma iniciativa do Instituto Tecnológico da Costa Rica (ITCR) que reúne profissionais e docentes de diferentes níveis educacionais, nacionais e internacionais, com o objetivo de refletir sobre o ensino da estatística, da probabilidade e da análise de dados. Este volume apresenta uma seleção de contribuições do II EDEPA, realizado em novembro de 2011, bem como trabalhos provenientes da I Escola de Verão EDEPA, realizada em dezembro de 2012. Os conteúdos estão organizados em três seções principais: didática, aplicações e uso de software, oferecendo diversas perspectivas sobre estratégias pedagógicas, experiências em sala de aula e integração de ferramentas tecnológicas. A obra busca fortalecer a alfabetização estatística e o pensamento probabilístico, promovendo a inovação e o intercâmbio acadêmico no campo da educação matemática.",

    "keywords_pt": [
      "didática da estatística",
      "probabilidade",
      "análise de dados",
      "educação matemática",
      "uso de software",
      "inovação pedagógica"
    ],

    "citation": "Mora Flores, W., & Ramírez Arce, G. (2013). Encuentro sobre Didáctica de la Estadística, la Probabilidad y el Análisis de Datos (EDEPA). Instituto Tecnológico de Costa Rica. Recuperado de: https://tecdigital.tec.ac.cr/servicios/revistamatematica/libros/universitaria/estadistica/edepa-2013/"
  },
  "fractales-2010": {
    "coverImage": "/libros/universitaria/analisis/fractales-2010/portada.webp",
    "title": "Fractales",
    "title_en": "Fractals",
    "authors": [
      "Manuel Alfaro",
      {
        "name": "Manuel Murillo",
        "email": "mmurillot@gmail.com",
        "location": "Costa Rica"
      },
      "Alberto Soto"
    ],
    "lastRevision": "2010",
    "category": "universitaria ",
    "pdf": "/libros/universitaria/analisis/fractales-2010/libro.pdf",
    "abstract_es": "Este libro introduce de manera clara y accesible los fundamentos teóricos y las aplicaciones de los fractales, un campo que combina la matemática, la geometría y la computación para modelar estructuras irregulares presentes en la naturaleza. Se abordan conceptos esenciales como la autosimilitud, la dimensión fractal y los sistemas iterativos, acompañados de ejemplos visuales y ejercicios prácticos. Además, se exploran conexiones entre los fractales y otras áreas como el caos, la geometría dinámica y la simulación computacional. La obra busca desarrollar una comprensión conceptual del fenómeno fractal y su relevancia en el análisis de patrones, procesos naturales y fenómenos complejos.",

    "keywords_es": [
      "fractales",
      "geometría fractal",
      "autosimilitud",
      "dimensión fractal",
      "sistemas iterativos",
      "caos",
      "simulación computacional"
    ],

    "abstract_en": "This book provides a clear and accessible introduction to the theoretical foundations and applications of fractals, a field that combines mathematics, geometry, and computing to model irregular structures found in nature. It covers key concepts such as self-similarity, fractal dimension, and iterative systems, supported by visual examples and practical exercises. The text also explores connections between fractals and other areas such as chaos, dynamic geometry, and computational simulation. The work aims to develop a conceptual understanding of the fractal phenomenon and its relevance to the analysis of patterns, natural processes, and complex systems.",

    "keywords_en": [
      "fractals",
      "fractal geometry",
      "self-similarity",
      "fractal dimension",
      "iterative systems",
      "chaos",
      "computational simulation"
    ],

    "abstract_pt": "Este livro apresenta de forma clara e acessível os fundamentos teóricos e as aplicações dos fractais, um campo que combina matemática, geometria e computação para modelar estruturas irregulares presentes na natureza. São abordados conceitos essenciais como a auto-similaridade, a dimensão fractal e os sistemas iterativos, acompanhados de exemplos visuais e exercícios práticos. Além disso, explora conexões entre os fractais e outras áreas como o caos, a geometria dinâmica e a simulação computacional. A obra busca desenvolver uma compreensão conceitual do fenômeno fractal e sua relevância na análise de padrões, processos naturais e sistemas complexos.",

    "keywords_pt": [
      "fractais",
      "geometria fractal",
      "auto-similaridade",
      "dimensão fractal",
      "sistemas iterativos",
      "caos",
      "simulação computacional"
    ],

    "citation": "Alfaro, M., Murillo, M., & Soto, A. (2010). Fractales. Instituto Tecnológico de Costa Rica. Recuperado de: https://tecdigital.tec.ac.cr/servicios/revistamatematica/libros/universitaria/analisis/fractales-2010/"
  },
  "xxx-ocm-2018": {
    "coverImage": "/libros/universitaria/olimpiadas/xxx-ocm-2018/portada.webp",
    "title": "Problemas de exámenes y soluciones XXX Olimpiada Costarricense de Matemáticas",
    "title_en": "Exam problems and solutions XXX Costa Rican Mathematics Olympiad. 2018",
    "title_pt": "Problemas de exames e soluções XXX Olimpíada Costarriquenha de Matemática. 2018",
    "authors": [
      {
        "name": "Christian Páez",
        "email": "cpaez@itcr.ac.cr",
        "orcid": "https://orcid.org/0009-0008-5651-4699",
        "university": "Instituto Tecnológico de Costa Rica, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "Marvin Abarca",
        "email": "mabarca@itcr.ac.cr",
        "university": "Instituto Tecnológico de Costa Rica, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "Leonel Chaves",
        "email": "leonel.chaves.salas@una.cr",
        "university": "Universidad Nacional, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "Alexander Hernández",
        "email": "alexander.hernandez.quiros@una.cr",
        "university": "Universidad Nacional, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "Gabriela Calderón",
        "email": "maria.calderon.torres@una.cr",
        "university": "Universidad Nacional, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "Federico Mora",
        "email": "federico.mora.mora@una.cr",
        "orcid": "https://orcid.org/0000-0002-4244-3737",
        "university": "Universidad Nacional, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "Jeremías Ramírez",
        "email": "jeremias.ramirez.jimenez@una.cr",
        "orcid": "https://orcid.org/0000-0001-6608-791X",
        "university": "Universidad Nacional, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "David Jiménez",
        "email": "david.jimenezlopez@ucr.ac.cr",
        "orcid": "https://orcid.org/0000-0002-1087-8269",
        "university": "Universidad de Costa Rica, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "German Mora",
        "email": "germorasaenz@gmail.com",
        "university": "Universidad Nacional, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "Emmanuel Chaves",
        "email": "echaves@uned.ac.cr",
        "orcid": "https://orcid.org/0000-0001-8925-1532",
        "university": "Universidad Estatal a Distancia, Escuela de Ciencias Exactas y Naturales",
        "location": "Costa Rica"
      },
      {
        "name": "Salomón Hernández",
        "email": "shernandezch@hotmail.com",
        "orcid": "https://orcid.org/0009-0004-4939-0342",
        "university": "Universidad Estatal a Distancia, Escuela de Ciencias Exactas y Naturales",
        "location": "Costa Rica"
      }
    ],
    "lastRevision": "Febrero 2020",
    "category": "universitaria",
    "pdf": "/libros/universitaria/olimpiadas/xxx-ocm-2018/libro.pdf",
    "abstract_es": "OLCOMA es la Comisión de Olimpiadas Costarricenses de Matemáticas. Esta comisión está conformada por académicos en el área de Matemática de la Universidad Nacional, del Instituto Tecnológico de Costa Rica, de la Universidad de Costa Rica, de la Universidad Estatal a Distancia, y por representantes del Ministerio de Educación Pública y del Ministerio de Ciencia, Tecnología y Telecomunicaciones. Dentro de la estructura de las Olimpiadas Costarricenses de Matemáticas se tienen tres niveles de competencia. En el Nivel I participan estudiantes de sétimo año, entre 10 y 13 años, aproximadamente (también pueden participar estudiantes de primaria que cursan sexto grado). En el Nivel II participan estudiantes de octavo y noveno años, entre 14 y 15 años, aproximadamente. En el Nivel III participan estudiantes de décimo, undécimo y duodécimo años, mayores de 15 años. Durante el año 2017 se trabajó con tres etapas. En la I Eliminatoria, los estudiantes resolvieron un examen de selección única con 25 ítems. En la II Eliminatoria, los clasificados realizaron un examen con 12 preguntas de selección única y tres problemas de desarrollo. En la Etapa Final, los estudiantes clasificados realizaron dos pruebas en días consecutivos, cada una con tres problemas de desarrollo. El objetivo de este libro es que los futuros participantes en Olimpiadas Costarricenses de Matemáticas posean material de consulta. Los problemas que en este libro se enuncian representan un reto para quienes gustan resolver ejercicios matemáticos. Cada uno de los problemas tiene la solución respectiva, de modo que, una vez que intenten resolver cada problema, puedan comparar el procedimiento realizado con la solución propuesta. Se han incorporado todos los problemas de la I Eliminatoria, II Eliminatoria y Etapa Final para cada uno de los tres niveles de competencia.",
    "keywords_es": ["Problemas", "Olimpiadas matemáticas costarricenses"],
    "abstract_en": "OLCOMA is the Costa Rican Mathematics Olympiads Commission. This commission is made up of academics in the field of Mathematics from the Universidad Nacional, the Costa Rica Institute of Technology, the Universidad de Costa Rica, the Universidad Estatal a Distancia, and representatives of the Ministry of Public Education and the Ministry of Science, Technology, and Telecommunications. Within the structure of the Costa Rican Mathematics Olympiads, there are three levels of competition. Level I includes students from seventh grade, between 10 and 13 years old (primary school students in sixth grade may also participate). Level II includes students from eighth and ninth grades, approximately between 14 and 15 years old. Level III includes students from tenth, eleventh, and twelfth grades, over 15 years old. During 2017, the competition included three stages. In the First Elimination, students solved a single-selection test with 25 items. In the Second Elimination, the qualified students completed a test with 12 single-choice questions and three development problems. In the Final Stage, the classified students took two tests on consecutive days, each with three development problems. The objective of this book is to provide future participants of the Costa Rican Mathematics Olympiads with reference material. The problems presented here are a challenge for those who enjoy solving mathematical exercises. Each problem includes its respective solution so that, after attempting to solve it, readers can compare their approach with the proposed one. All problems from the First, Second, and Final Stages have been incorporated for each of the three competition levels.",
    "keywords_en": ["Problems", "Costa Rican mathematical olympiads"],
    "abstract_pt": "OLCOMA é a Comissão Costarriquenha de Olimpíadas de Matemática. Esta comissão é composta por acadêmicos da área de Matemática da Universidade Nacional, do Instituto Tecnológico da Costa Rica, da Universidade da Costa Rica, da Universidade Estatal a Distância e por representantes do Ministério da Educação Pública e do Ministério da Ciência, Tecnologia e Telecomunicações. Dentro da estrutura das Olimpíadas Costarriquenhas de Matemática, existem três níveis de competição. No Nível I participam estudantes do sétimo ano, entre 10 e 13 anos (também podem participar alunos do sexto ano do ensino fundamental). No Nível II participam estudantes do oitavo e nono anos, entre 14 e 15 anos, aproximadamente. No Nível III participam estudantes do décimo, décimo primeiro e décimo segundo anos, com mais de 15 anos. Durante o ano de 2017, o trabalho foi desenvolvido em três etapas. Na Primeira Eliminatória, os estudantes resolveram uma prova de seleção única com 25 itens. Na Segunda Eliminatória, os classificados realizaram uma prova com 12 questões de seleção única e três problemas de desenvolvimento. Na Etapa Final, os classificados realizaram duas provas em dias consecutivos, cada uma com três problemas de desenvolvimento. O objetivo deste livro é que os futuros participantes das Olimpíadas Costarriquenhas de Matemática tenham material de consulta. Os problemas apresentados neste livro representam um desafio para quem gosta de resolver exercícios matemáticos. Cada problema tem sua respectiva solução, para que, após tentar resolvê-lo, o leitor possa comparar o procedimento adotado com a solução proposta. Foram incorporados todos os problemas da Primeira, Segunda e Etapa Final para cada um dos três níveis de competição.",
    "keywords_pt": ["Problemas", "Olimpíadas matemáticas costarriquenhas"],
    "citation": "Páez, C., Abarca, M., Chaves, L., Hernández, A., Calderón, G., Mora, F., Ramírez, J., Jiménez, D., Mora, G., Chaves, E., Hernández, S. (2020). Problemas de exámenes y soluciones XXX Olimpiada Costarricense de Matemáticas. Revista digital Matemática, Educación e Internet, 22(1). Recuperado de: https://tecdigital.tec.ac.cr/servicios/revistamatematica/libros/xxx-ocm-2018/"
  },

  "xxix-ocm-2017": {
    "coverImage": "/libros/universitaria/olimpiadas/xxix-ocm-2017/portada.webp",
    "title": "Problemas de exámenes y soluciones XXIX Olimpiada Costarricense de Matemáticas",
    "title_en": "Exam problems and solutions XXIX Costa Rican Mathematics Olympiad. 2017",
    "title_pt": "Problemas de exames e soluções XXIX Olimpíada Costarriquenha de Matemática. 2017",
    "authors": [
      {
        "name": "Christian Páez",
        "email": "cpaez@itcr.ac.cr",
        "orcid": "https://orcid.org/0009-0008-5651-4699",
        "university": "Instituto Tecnológico de Costa Rica, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "Marvin Abarca",
        "email": "mabarca@itcr.ac.cr",
        "university": "Instituto Tecnológico de Costa Rica, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "Leonel Chaves",
        "email": "leonel.chaves.salas@una.cr",
        "university": "Universidad Nacional, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "Alexander Hernández",
        "email": "alexander.hernandez.quiros@una.cr",
        "university": "Universidad Nacional, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "Gabriela Calderón",
        "email": "maria.calderon.torres@una.cr",
        "university": "Universidad Nacional, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "Federico Mora",
        "email": "federico.mora.mora@una.cr",
        "orcid": "https://orcid.org/0000-0002-4244-3737",
        "university": "Universidad Nacional, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "Jeremías Ramírez",
        "email": "jeremias.ramirez.jimenez@una.cr",
        "orcid": "https://orcid.org/0000-0001-6608-791X",
        "university": "Universidad Nacional, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "David Jiménez",
        "email": "david.jimenezlopez@ucr.ac.cr",
        "orcid": "https://orcid.org/0000-0002-1087-8269",
        "university": "Universidad de Costa Rica, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "German Mora",
        "email": "germorasaenz@gmail.com",
        "university": "Universidad de Costa Rica, Escuela de Matemática",
        "location": "Costa Rica"
      },
      {
        "name": "Emmanuel Chaves",
        "email": "echaves@uned.ac.cr",
        "orcid": "https://orcid.org/0000-0001-8925-1532",
        "university": "Universidad Estatal a Distancia, Escuela de Ciencias Exactas y Naturales",
        "location": "Costa Rica"
      },
      {
        "name": "Salomón Hernández",
        "email": "shernandezch@hotmail.com",
        "orcid": "https://orcid.org/0009-0004-4939-0342",
        "university": "Universidad Estatal a Distancia, Escuela de Ciencias Exactas y Naturales",
        "location": "Costa Rica"
      }
    ],
    "received": "12 de febrero de 2019",
    "accepted": "28 de febrero de 2019",
    "category": "universitaria",
    "pdf": "/libros/universitaria/olimpiadas/xxix-ocm-2017/libro.pdf",
    "abstract_es": "OLCOMA es la Comisión de Olimpiadas Costarricenses de Matemáticas. Esta comisión está conformada por académicos en el área de Matemática de la Universidad Nacional, del Instituto Tecnológico de Costa Rica, de la Universidad de Costa Rica, de la Universidad Estatal a Distancia y por representantes del Ministerio de Educación Pública y del Ministerio de Ciencia, Tecnología y Telecomunicaciones. Dentro de la estructura de las Olimpiadas Costarricenses de Matemáticas se tienen tres niveles de competencia. En el Nivel I participan estudiantes de sétimo año, entre 10 y 13 años aproximadamente (también pueden optar por participar en este nivel los estudiantes de primaria que cursan sexto grado). En el Nivel II participan estudiantes de octavo y noveno años, entre 14 y 15 años aproximadamente. En el Nivel III participan estudiantes de décimo, undécimo y duodécimo años, mayores de 15 años. Durante el año 2017 se trabajó con tres etapas. En la I Eliminatoria los estudiantes resolvieron un examen de selección única con 25 ítems. En la II Eliminatoria los clasificados realizaron un examen con 12 preguntas de selección única y tres problemas de desarrollo. En la Etapa Final los estudiantes clasificados realizaron dos pruebas en días consecutivos, cada una con tres problemas de desarrollo. El objetivo de este libro es que los futuros participantes en las Olimpiadas Costarricenses de Matemáticas posean material de consulta. Los problemas que en este libro se enuncian representan un reto para quienes gustan resolver ejercicios matemáticos. Cada uno de los problemas tiene la solución respectiva, de modo que, una vez que intenten resolver cada problema, puedan comparar el procedimiento realizado con la solución propuesta. Se han incorporado todos los problemas de la I Eliminatoria, la II Eliminatoria y la Etapa Final para cada uno de los tres niveles de competencia.",
    "keywords_es": ["Problemas", "Olimpiadas matemáticas costarricenses"],
    "abstract_en": "OLCOMA is the Costa Rican Mathematics Olympiads Commission. This commission is made up of academics in the field of Mathematics from the Universidad Nacional, the Costa Rica Institute of Technology, the Universidad de Costa Rica, the Universidad Estatal a Distancia, and representatives of the Ministry of Public Education and the Ministry of Science, Technology, and Telecommunications. Within the structure of the Costa Rican Mathematics Olympiads, there are three levels of competition. Level I includes students from seventh grade, between 10 and 13 years old (primary school students in sixth grade may also participate). Level II includes students from eighth and ninth grades, approximately between 14 and 15 years old. Level III includes students from tenth, eleventh, and twelfth grades, over 15 years old. During 2017, the competition included three stages. In the First Elimination, students solved a single-selection test with 25 items. In the Second Elimination, the qualified students completed a test with 12 single-choice questions and three development problems. In the Final Stage, the classified students took two tests on consecutive days, each with three development problems. The objective of this book is to provide future participants of the Costa Rican Mathematics Olympiads with reference material. The problems presented here are a challenge for those who enjoy solving mathematical exercises. Each problem includes its respective solution so that, after attempting to solve it, readers can compare their approach with the proposed one. All problems from the First, Second, and Final Stages have been incorporated for each of the three competition levels.",
    "keywords_en": ["Problems", "Costa Rican mathematical olympiads"],
    "abstract_pt": "OLCOMA é a Comissão Costarriquenha de Olimpíadas de Matemática. Esta comissão é composta por acadêmicos da área de Matemática da Universidade Nacional, do Instituto Tecnológico da Costa Rica, da Universidade da Costa Rica, da Universidade Estatal a Distância e por representantes do Ministério da Educação Pública e do Ministério da Ciência, Tecnologia e Telecomunicações. Dentro da estrutura das Olimpíadas Costarriquenhas de Matemática, existem três níveis de competição. No Nível I participam estudantes do sétimo ano, entre 10 e 13 anos (também podem participar alunos do sexto ano do ensino fundamental). No Nível II participam estudantes do oitavo e nono anos, entre 14 e 15 anos, aproximadamente. No Nível III participam estudantes do décimo, décimo primeiro e décimo segundo anos, com mais de 15 anos. Durante o ano de 2017, o trabalho foi desenvolvido em três etapas. Na Primeira Eliminatória, os estudantes resolveram uma prova de seleção única com 25 itens. Na Segunda Eliminatória, os classificados realizaram uma prova com 12 questões de seleção única e três problemas de desenvolvimento. Na Etapa Final, os classificados realizaram duas provas em dias consecutivos, cada uma com três problemas de desenvolvimento. O objetivo deste livro é que os futuros participantes das Olimpíadas Costarriquenhas de Matemática tenham material de consulta. Os problemas apresentados neste livro representam um desafio para quem gosta de resolver exercícios matemáticos. Cada problema tem sua respectiva solução, para que, após tentar resolvê-lo, o leitor possa comparar o procedimento adotado com a solução proposta. Foram incorporados todos os problemas da Primeira, Segunda e Etapa Final para cada um dos três níveis de competição.",
    "keywords_pt": ["Problemas", "Olimpíadas matemáticas costarriquenhas"],
    "citation": "Páez, C., Abarca, M., Chaves, L., Hernández, A., Calderón, G., Mora, F., Ramírez, J., Jiménez, D., Mora, G., Chaves, E., Hernández, S. (2019). Problemas de exámenes y soluciones XXIX Olimpiada Costarricense de Matemáticas. Revista digital Matemática, Educación e Internet, 21(1). Recuperado de: https://tecdigital.tec.ac.cr/servicios/revistamatematica/libros/xxix-ocm-2017/"
  }
}
