{
  "issueTitle": "Volumen 25, Número 1, Agosto 2024 - Febrero 2025",
  "articles": [
    {
      "id": 1,
      "title": "Una interpretación geométrica de los Axiomas de Peano como estrategia didáctica para la enseñanza y aprendizaje de los números naturales",
      "title_en": "A geometric interpretation of the Peano Axioms as a didactic strategy for teaching and learning natural numbers",
      "volume": 25,
      "number": 1,
      "language": "es",
      "published": "2024-08-01",
      "authors": [
        {
          "name": "Jesús Guillén Ruiz",
          "email": "jesus.guillen@isfodosu.edu.do",
          "university": "Instituto Superior de Formación Docente Salomé Ureña",
          "location": "Santo Domingo de los Caballeros, República Dominicana",
          "orcid": "https://orcid.org/0000-0002-5548-5821"
        },
        {
          "name": "Dirwin Muñoz Pinto",
          "email": "dirwin.munoz@isfodosu.edu.do",
          "university": "Instituto Superior de Formación Docente Salomé Ureña",
          "location": "Santo Domingo de los Caballeros, República Dominicana",
          "orcid": "https://orcid.org/0000-0002-2400-9064"
        },
        {
          "name": "Pedro Peña Duarte",
          "email": "pedro.pena@isfodosu.edu.do",
          "university": "Instituto Superior de Formación Docente Salomé Ureña",
          "location": "Licey al Medio, República Dominicana",
          "orcid": "https://orcid.org/0000-0002-3746-0030"
        }
      ],
      "slug": "Articulos/V25/N1_2024/Guillen",
      "pdf": "/Articulos/V25/N1_2024/Guillen/RevistaDigital_V25_n1_2024_Guillen.pdf",
      "doi": "https://doi.org/10.18845/meij.v25i1.7094",
      "received": "10 de abril 2023",
      "accepted": "15 marzo 2024",
      "abstract_es": "Los axiomas de Peano son un conjunto de proposiciones que permiten definir de manera formal el conjunto de números naturales. En estos axiomas, Peano rescata la esencia de contar objetos y la materializa asumiendo la existencia de un conjunto, de una función en dicho conjunto (a la que llama sucesor) y un axioma de inducción. En este trabajo se hace una representación e interpretación geométrica de cada uno de estos axiomas que permiten comprender la independencia y necesidad de cada uno de ellos, lo que facilita el rigor conceptual de los mismos haciendo uso del lenguaje matemático. Por último, usando la geometría euclidiana, se hace una construcción geométrica de un sistema de números naturales sobre una recta.",
      "abstract_en": "Peano’s axioms are a set of propositions that allow a formal definition of the set of natural numbers. In these axioms, Peano rescues the essence of counting objects and materializes it by assuming the existence of a set, of a function in this set (which he calls successor) and an axiom of induction. In this work a geometrical representation and interpretation of each of these axioms is made, which allows understanding the independence and necessity of each one of them, which facilitates the conceptual rigor of them by making use of mathematical language. Finally, using Euclidean geometry, a geometric construction of a system of natural numbers on a straight line is made.",
      "abstract_pt": "Os axiomas de Peano são um conjunto de proposições que permitem definir formalmente o conjunto dos números naturais. Nesses axiomas, Peano resgata a essência de contar objetos e a materializa assumindo a existência de um conjunto, de uma função nesse conjunto (à qual ele chama sucessor) e um axioma de indução. Neste trabalho é feita uma representação e interpretação geométrica de cada um desses axiomas, o que permite compreender a independência e a necessidade de cada um deles, facilitando o rigor conceitual por meio da linguagem matemática. Por fim, utilizando a geometria euclidiana, é realizada uma construção geométrica de um sistema de números naturais sobre uma reta.",
      "keywords_es": [
        "Números naturales",
        "geometría",
        "sucesor",
        "axiomas de Peano",
        "inducción"
      ],
      "keywords_en": [
        "Natural numbers",
        "geometry",
        "successor",
        "Peano’s axioms",
        "induction"
      ],
      "keywords_pt": [
        "Números naturais",
        "geometria",
        "sucessor",
        "axiomas de Peano",
        "indução"
      ],
      "citation": "Guillén Ruiz, J., Muñoz Pinto, D., & Peña Duarte, P. (2024). Una interpretación geométrica de los Axiomas de Peano como estrategia didáctica para la enseñanza y aprendizaje de los números naturales. Revista digital Matemática, Educación e Internet, 25(1). https://doi.org/10.18845/meij.v25i1.7094"
    },
    {
      "id": 2,
      "title": "Desenvolvimento e Implementação de Sequências Didáticas para EDOs de Segunda Ordem: Aplicações Práticas com GeoGebra",
      "title_en": "Development and Implementation of Didactic Sequences for Second Order ODEs: Practical Applications with GeoGebra",
      "volume": 25,
      "number": 1,
      "language": "pt",
      "published": "2024-08-01",
      "authors": [
        {
          "name": "Ana Carla Pimentel Paiva",
          "email": "carlapimentel00@gmail.com",
          "university": "Instituto Federal de Educação, Ciência e Tecnologia do Ceará-IFCE (campus Fortaleza)",
          "location": "Fortaleza, Brasil",
          "orcid": "https://orcid.org/0000-0001-5801-9562"
        },
        {
          "name": "Francisco Régis Vieira Alves",
          "email": "fregis@ifce.edu.br",
          "university": "Instituto Federal de Educação, Ciência e Tecnologia do Ceará-IFCE (campus Fortaleza)",
          "location": "Fortaleza, Brasil",
          "orcid": "https://orcid.org/0000-0003-3710-1561"
        },
        {
          "name": "Helena Maria de Barros Campos",
          "email": "hcampos@utad.pt",
          "university": "Universidade de Trás-os-Montes e Alto Douro–UTAD",
          "location": "Vila Real, Portugal",
          "orcid": "https://orcid.org/0000-0003-2767-0998"
        }
      ],
      "slug": "Articulos/V25/N1_2024/Paiva",
      "pdf": "/Articulos/V25/N1_2024/Paiva/RevistaDigital_V25_n1_2024_Paiva.pdf",
      "doi": "https://doi.org/10.18845/meij.v25i1.7235",
      "received": "30 octubre 2023",
      "accepted": "30 mayo 2024",
      "abstract_es": "Las Ecuaciones Diferenciales Ordinarias de Segundo Orden son un tema considerado en el enfoque tradicional de la teoría de las Ecuaciones Diferenciales Ordinarias (EDO). En este artículo se describen, de modo particular, dos etapas previstas por la Ingeniería Didáctica (ID): las fases de análisis preliminar y de análisis a priori. Se enfatizan actividades descritas y estructuradas con apoyo de la tecnología. La mediación favorecida por el uso adecuado de software permite evitar ciertos elementos que actúan como obstáculos para una comprensión amplia, inherente a estas ecuaciones. De este modo, se indican y estructuran situaciones-problema en GeoGebra con el fin de emplear la visualización en la comprensión de propiedades cualitativas (gráfico-geométricas) y no solo de naturaleza algorítmica. Así, se proporciona la descripción de factores pertinentes a la mediación didáctica de las ecuaciones diferenciales de segundo orden.",
      "abstract_en": "Second Order Ordinary Differential Equations are a subject considered in the traditional approach to the theory of Ordinary Differential Equations – ODE. This article describes, in particular, two stages foreseen by Didactic Engineering – DE: the phases of preliminary analysis and a priori analysis. Activities described/structured with the support of technology are emphasized. Mediation affected by the appropriate exploitation of software makes it possible to avoid certain elements that act as obstacles to a broad understanding, inherent to these equations. In this way, we indicate and structure problem situations in GeoGebra, in order to use visualization to understand qualitative properties (graphic-geometric) and not just algorithmic ones. Thus, we provide the description of factors relevant to the didactic mediation of second-order differential equations.",
      "abstract_pt": "As Equações Diferenciais Ordinárias de Segunda Ordem se apresentam como um assunto considerado na abordagem tradicional da teoria de Equações Diferenciais Ordinárias – EDO. Nesse artigo se descreve, de modo particular, duas etapas previstas pela Engenharia Didática – ED: as fases de análise prévia e análise a priori. Enfatizam-se atividades descritas/estruturadas com apoio da tecnologia. A mediação afetada pela exploração adequada de softwares possibilita evitar determinados elementos que atuam como entraves a um entendimento amplo, inerente a essas equações. Desse modo, indicamos e estruturamos situações-problema no Geogebra, de modo a empregar a visualização no entendimento de propriedades qualitativas (gráfico-geométricas) e não apenas de natureza algorítmica. Proporcionando assim, a descrição de fatores pertinentes à mediação didática das equações diferenciais de segunda ordem.",
      "keywords_es": [
        "Ecuaciones Diferenciales Ordinarias",
        "Ingeniería Didáctica",
        "GeoGebra"
      ],
      "keywords_en": [
        "Second Order Ordinary Differential Equations",
        "Didactic Engineering",
        "GeoGebra"
      ],
      "keywords_pt": [
        "Equações Diferenciais Ordinárias",
        "Engenharia Didática",
        "Geogebra"
      ],
      "citation": "Pimentel Paiva, A. C., Vieira Alves, F. R., & de Barros Campos, H. M. (2024). Desenvolvimento e Implementação de Sequências Didáticas para EDOs de Segunda Ordem: Aplicações Práticas com GeoGebra. Revista digital Matemática, Educação e Internet, 25(1). https://doi.org/10.18845/meij.v25i1.7235"
    },
    {
      "id": 3,
      "title": "Modelo de Transformación Docente a través de Redes Sociales: ejemplificación en X para la educación matemática en la era digital",
      "title_en": "Model of Teaching Transformation through Social Networks: exemplification in X for mathematics education in the digital era",
      "volume": 25,
      "number": 1,
      "language": "es",
      "published": "2024-08-01",
      "authors": [
        {
          "name": "Ángel Alsina",
          "email": "angel.alsina@udg.edu",
          "university": "Universidad de Girona",
          "location": "Girona, España",
          "orcid": "https://orcid.org/0000-0001-8506-1838"
        }
      ],
      "slug": "Articulos/V25/N1_2024/Alsina",
      "pdf": "/Articulos/V25/N1_2024/Alsina/RevistaDigital_V25_n1_2024_Alsina.pdf",
      "doi": "https://doi.org/10.18845/meij.v25i1.7236",
      "received": "5 diciembre 2023",
      "accepted": "1 junio 2024",
      "abstract_es": "El objetivo de este artículo es presentar el Modelo de Transformación Docente a través de Redes Sociales (TD-RedesS), cuyo propósito principal es contribuir a una mejor comprensión del papel que juegan las redes sociales y cómo pueden utilizarse como estrategia informal para la formación del profesorado. Para ello, el artículo se estructura en tres partes, ejemplificadas en la educación matemática pero aplicables a cualquier otra área de conocimiento: en primer lugar, se fundamenta el desarrollo profesional del profesorado de matemáticas desde la perspectiva de la transformación docente; en segundo lugar, dado que el modelo TD-RedesS se ejemplifica en la red social X (antes Twitter), tanto por su valor educativo como por su acceso rápido a la información, se indaga en el uso de esta red como herramienta formativa para el profesorado de matemáticas en la era digital; y, en tercer lugar, se describe el modelo TD-RedesS: (a) para los emisores, incluye las estrategias de marketing en línea y los elementos para el seguimiento y reflexión posterior de las informaciones publicadas; (b) para los receptores, incluye la dimensión cognitiva (conocimientos), la procedimental (habilidades digitales) y la actitudinal (actitudes), junto con un ciclo de reflexión para promover la expansión conceptual y, de forma más general, contribuir al desarrollo profesional docente.",
      "abstract_en": "The aim of this article is to present the Teaching Transformation through Social Networks (TD-RedesS) model, whose main purpose is to contribute to a better understanding of the role of social networks and how they can be used as an informal strategy for teacher education. To this end, the article is structured in three parts, exemplified in the area of mathematics education but applicable to any other area of knowledge: first, the professional development of mathematics teachers is grounded from the perspective of teacher transformation; second, given that the TD-RedesS model is exemplified in the social network X (formerly Twitter), both for its educational value and for its rapid access to information, the use of this network as a training tool for mathematics teachers in the digital age is explored; and third, the TD-RedesS model is described: (a) for senders, it includes online marketing strategies and elements for subsequent monitoring and reflection on published information; (b) for receivers, it includes the cognitive (knowledge), procedural (digital skills) and attitudinal (attitudes) dimensions, together with a cycle of reflection to promote conceptual expansion and, more generally, to contribute to teacher professional development.",
      "abstract_pt": "O objetivo deste artigo é apresentar o Modelo de Transformação Docente por meio das Redes Sociais (TD-RedesS), cujo principal propósito é contribuir para uma melhor compreensão do papel que as redes sociais desempenham e de como podem ser utilizadas como estratégia informal para a formação de professores. Para isso, o artigo é estruturado em três partes, exemplificadas na educação matemática, mas aplicáveis a qualquer outra área do conhecimento: em primeiro lugar, fundamenta-se o desenvolvimento profissional do professorado de matemática a partir da perspectiva da transformação docente; em segundo lugar, dado que o modelo TD-RedesS é exemplificado na rede social X (anteriormente Twitter), tanto por seu valor educativo quanto por seu rápido acesso à informação, investiga-se o uso dessa rede como ferramenta formativa para o professorado de matemática na era digital; e, em terceiro lugar, descreve-se o modelo TD-RedesS: (a) para os emissores, inclui estratégias de marketing online e elementos para o acompanhamento e reflexão posterior das informações publicadas; (b) para os receptores, inclui as dimensões cognitiva (conhecimentos), procedimental (habilidades digitais) e atitudinal (atitudes), juntamente com um ciclo de reflexão para promover a expansão conceitual e, de forma mais geral, contribuir para o desenvolvimento profissional docente.",
      "keywords_es": [
        "Profesorado de matemáticas",
        "desarrollo profesional",
        "transformación docente",
        "redes sociales",
        "Twitter/X"
      ],
      "keywords_en": [
        "Mathematics teachers",
        "professional development",
        "teacher transformation",
        "social networks",
        "Twitter/X"
      ],
      "keywords_pt": [
        "Professorado de matemática",
        "desenvolvimento profissional",
        "transformação docente",
        "redes sociais",
        "Twitter/X"
      ],
      "citation": "Alsina, Á. (2024). Modelo de Transformación Docente a través de Redes Sociales: ejemplificación en X para la educación matemática en la era digital. Revista Digital: Matemática, Educación e Internet, 25(1). https://doi.org/10.18845/meij.v25i1.7236"
    },
    {
      "id": 4,
      "title": "La enseñanza de los gráficos estadísticos: reseña de un libro de texto interactivo para tercer año de la educación costarricense",
      "title_en": "The teaching of statistical graphs: review of an interactive textbook for third grade in Costa Rican education",
      "volume": 25,
      "number": 1,
      "language": "es",
      "published": "2024-08-01",
      "authors": [
        {
          "name": "Carlos Monge Madriz",
          "email": "camonge@tec.ac.cr",
          "university": "Instituto Tecnológico de Costa Rica",
          "location": "Cartago, Costa Rica",
          "orcid": "https://orcid.org/0000-0002-5148-2797"
        },
        {
          "name": "Zuleyka Suárez Valdés-Ayala",
          "email": "zsuarez@tec.ac.cr",
          "university": "Instituto Tecnológico de Costa Rica",
          "location": "Escazú, Costa Rica",
          "orcid": "https://orcid.org/0000-0002-1822-4825"
        },
        {
          "name": "Rebeca Solís Ortega",
          "email": "rsolis@tec.ac.cr",
          "university": "Instituto Tecnológico de Costa Rica",
          "location": "Cartago, Costa Rica",
          "orcid": "https://orcid.org/0000-0002-3065-8386"
        },
        {
          "name": "Luis Gerardo Meza Cascante",
          "email": "gemeza@tec.ac.cr",
          "university": "Instituto Tecnológico de Costa Rica",
          "location": "Cartago, Costa Rica",
          "orcid": "https://orcid.org/0000-0002-5413-0172"
        }
      ],
      "slug": "Articulos/V25/N1_2024/Monge",
      "pdf": "/Articulos/V25/N1_2024/Monge/RevistaDigital_V25_n1_2024_Monge.pdf",
      "doi": "https://doi.org/10.18845/meij.v25i1.7237",
      "received": "23 setiembre 2023",
      "accepted": "30 marzo 2024",
      "abstract_es": "Este artículo presenta un libro interactivo de estadística destinado al tercer año de primaria, dirigido a niños y niñas de entre 8 y 9 años aproximadamente. El material fue elaborado en el año 2023 y se enfoca en la educación costarricense, analizando la pertinencia de sus actividades relacionadas con gráficos estadísticos. La metodología incluyó la identificación de habilidades, la revisión de un estudio sobre gráficos en libros de texto costarricenses, la consideración de aspectos teóricos, el diseño de actividades, el análisis de contenido y la validación con expertos. El libro promueve la resolución de problemas, la argumentación estadística y el uso de tecnología, de manera concordante con las disposiciones del programa de matemática vigente en la educación costarricense. Es un recurso educativo innovador y completo, que podría mejorar la enseñanza de estadística en la educación primaria.",
      "abstract_en": "This paper introduces an interactive statistics book designed for third-grade primary students, targeting both boys and girls aged approximately 8 to 9 years old. Developed in 2023, the material is centered around Costa Rican education, examining the significance of its activities pertaining to statistical graphics. The methodology involved skill identification, a review of a study on graphics in Costa Rican textbooks, consideration of theoretical aspects, activity design, content analysis, and validation by experts. The book promotes problem-solving, statistical argumentation, and the utilization of technology, aligning with the current mathematics curriculum in Costa Rican education. It stands as an innovative and comprehensive educational resource poised to enhance the teaching of statistics in primary education.",
      "abstract_pt": "Este artigo apresenta um livro interativo de estatística destinado ao terceiro ano do ensino fundamental, voltado para meninos e meninas com idades aproximadas entre 8 e 9 anos. O material foi elaborado em 2023 e está centrado na educação costarriquenha, analisando a pertinência de suas atividades relacionadas a gráficos estatísticos. A metodologia incluiu a identificação de habilidades, a revisão de um estudo sobre gráficos em livros didáticos costarriquenhos, a consideração de aspectos teóricos, o desenho de atividades, a análise de conteúdo e a validação por especialistas. O livro promove a resolução de problemas, a argumentação estatística e o uso da tecnologia, em consonância com o currículo de matemática vigente na educação da Costa Rica. Trata-se de um recurso educacional inovador e abrangente, que pode aprimorar o ensino de estatística no ensino fundamental.",
      "keywords_es": [
        "Enseñanza primaria",
        "estadística",
        "gráfico",
        "libro de texto",
        "enseñanza de la estadística"
      ],
      "keywords_en": [
        "Primary education",
        "statistics",
        "graphs",
        "textbooks",
        "statistics education"
      ],
      "keywords_pt": [
        "Ensino fundamental",
        "estatística",
        "gráficos",
        "livro didático",
        "ensino de estatística"
      ],
      "citation": "Monge Madriz, C., Suárez Valdés-Ayala, Z., Solís Ortega, R., & Meza Cascante, L. G. (2024). La enseñanza de los gráficos estadísticos: reseña de un libro de texto interactivo para tercer año de la educación costarricense. Revista Digital: Matemática, Educación e Internet, 25(1). https://doi.org/10.18845/meij.v25i1.7237"
    },
    {
      "id": 5,
      "title": "Representación Gráfica: recurso heurístico-didáctico para la enseñanza-aprendizaje de la Matemática",
      "title_en": "Graphical Representation: a heuristic-didactic resource for the teaching-learning of Mathematics",
      "volume": 25,
      "number": 1,
      "language": "es",
      "published": "2024-08-01",
      "authors": [
        {
          "name": "Sergio Bermudo Navarrete",
          "email": "sbernav@upo.es",
          "university": "Universidad Pablo de Olavide",
          "location": "Sevilla, España",
          "orcid": "https://orcid.org/0000-0003-4838-3170"
        },
        {
          "name": "Abel Cabrera Martínez",
          "email": "abecamar@gmail.com",
          "university": "Universidad de Córdoba",
          "location": "Córdoba, España",
          "orcid": "https://orcid.org/0000-0003-2806-4842"
        },
        {
          "name": "José Carlos Pinto Leivas",
          "email": "leivasjc@gmail.com",
          "university": "Universidade Franciscana – UFN",
          "location": "Santa Maria, Brasil",
          "orcid": "https://orcid.org/0000-0001-6876-1461"
        },
        {
          "name": "Osvaldo de Jesús Rojas Velázquez",
          "email": "orojasv69@una.edu.co",
          "university": "Universidad Antonio Nariño",
          "location": "Bogotá, Colombia",
          "orcid": "https://orcid.org/0000-0001-9015-2400"
        },
        {
          "name": "José M. Sigarreta Almira",
          "email": "jsmathguerrero@gmail.com",
          "university": "Universidad Autónoma de Guerrero",
          "location": "Acapulco, México",
          "orcid": "https://orcid.org/0000-0002-0863-4695"
        }
      ],
      "slug": "Articulos/V25/N1_2024/Bermudo",
      "pdf": "/Articulos/V25/N1_2024/Bermudo/RevistaDigital_V25_n1_2024_Bermudo.pdf",
      "doi": "https://doi.org/10.18845/meij.v25i1.7243",
      "received": "20 diciembre 2023",
      "accepted": "10 junio 2024",
      "abstract_es": "Las limitaciones y dificultades que presentan los estudiantes en el aprendizaje de la Matemática ponen de manifiesto la necesidad de dotar a los docentes de estrategias para favorecer su proceso de enseñanza-aprendizaje. En esta dirección, se propone una estrategia didáctica para aprovechar las potencialidades de la Representación Gráfica como recurso heurístico-didáctico en el proceso de enseñanza-aprendizaje de la Matemática.",
      "abstract_en": "The limitations and difficulties presented by students in the learning of Mathematics highlight the need to provide teachers with strategies to favor the teaching-learning process of Mathematics. In this direction, a didactic strategy is proposed to take advantage of the potential of Graphic Representation as a heuristic-didactic resource in the teaching-learning process of Mathematics.",
      "abstract_pt": "As limitações e dificuldades apresentadas pelos estudantes na aprendizagem da Matemática evidenciam a necessidade de fornecer aos docentes estratégias que favoreçam o processo de ensino-aprendizagem da Matemática. Nesse sentido, propõe-se uma estratégia didática para aproveitar as potencialidades da Representação Gráfica como recurso heurístico-didático no processo de ensino-aprendizagem da Matemática.",
      "keywords_es": [
        "Principio heurístico",
        "representación gráfica",
        "enseñanza-aprendizaje",
        "resolución de problemas"
      ],
      "keywords_en": [
        "Heuristic principle",
        "graphic representation",
        "teaching-learning",
        "problem solving"
      ],
      "keywords_pt": [
        "Princípio heurístico",
        "representação gráfica",
        "ensino-aprendizagem",
        "resolução de problemas"
      ],
      "citation": "Bermudo Navarrete, S., Cabrera Martínez, A., Pinto Leivas, J. C., Rojas Velázquez, O. de J., & Sigarreta Almira, J. M. (2024). Representación Gráfica: recurso heurístico-didáctico para la enseñanza-aprendizaje de la Matemática. Revista Digital: Matemática, Educación e Internet, 25(1). https://doi.org/10.18845/meij.v25i1.7243"
    }
  ]
}
