{
  "issueTitle": "Volumen 25, Número 2, Marzo 2025 - Agosto 2025",
  "articles": [
    {
      "id": 1,
      "title": "EREM: Aportes en competencias digitales al personal docente de matemática de la Región Caribe Norte de Costa Rica",
      "title_en": "EREM: Contributions on digital competences to the mathematics teaching staff of the Northern Caribbean Region of Costa Rica",
      "volume": 25,
      "number": 2,
      "language": "es",
      "published": "2025-03-01",
      "authors": [
        {
          "name": "Maynor Jiménez-Castro",
          "email": "mynor.jimenez@ucr.ac.cr",
          "university": "Universidad de Costa Rica",
          "location": "Guápiles, Costa Rica",
          "orcid": "https://orcid.org/0000-0001-7984-6866"
        },
        {
          "name": "Luis Fernando Mena Esquivel",
          "email": "luis.mena.esquivel@mep.go.cr",
          "university": "Universidad de Costa Rica",
          "location": "Guápiles, Costa Rica",
          "orcid": "https://orcid.org/0009-0004-4847-5264"
        }
      ],
      "slug": "Articulos/V25/N2_2025/Jimenez",
      "pdf": "/Articulos/V25/N2_2025/Jimenez/RevistaDigital_V25_n2_2025_Jimenez.pdf",
      "doi": "https://doi.org/10.18845/rdmei.v25i2.7542",
      "received": "9 de marzo de 2024",
      "accepted": "1 de agosto de 2024",
      "abstract_es": "Este artículo expone el impacto que ha dejado los Encuentros Regionales de Enseñanza de la Matemática (EREM), organizados por la Dirección Regional Educativa, el Recinto de la Universidad de Costa Rica en Guápiles y la Escuela de Matemática del Instituto Tecnológico de Costa Rica, en las competencias digitales a los docentes de primaria y secundaria participantes en los eventos comprendidos en el período 2011-2021. Para ello se trabajó con los docentes con mayor frecuencia de participaciones en estos encuentros, siguiendo los aspectos metodológicos del marco europeo para la Competencia Digital de los Educadores (DigCompEdu). En general, los resultados destacan niveles importantes de competencias digitales de B1 en Compromiso Profesional y Enseñanza y Aprendizaje y B2 en Contenidos digitales, pero un nivel incipiente en la competencia de Evaluación y Retroalimentación a través de herramientas digitales.",
      "abstract_en": "This article outlines the impact left by the Regional Mathematics Teaching Encounters (EREM), organized by the Regional Educational Directorate, the Campus of the University of Costa Rica in Guápiles, and the School of Mathematics of the Technological Institute of Costa Rica, on digital competences of primary and secondary school teachers who participated in the events carried out from 2011–2021. The study focused on teachers with the highest frequency of participation in these encounters, following the methodological aspects of the European Framework for Digital Competence of Educators (DigCompEdu). In general, the results highlight a relevant B1 level on digital competences in Professional Commitment and Teaching and Learning; and a B2 level on Digital Content. However, there is an incipient level on Evaluation and Feedback through digital tools.",
      "abstract_pt": "Este artigo descreve o impacto deixado pelos Encontros Regionais de Ensino da Matemática (EREM), organizados pela Direção Regional Educativa, pelo Campus da Universidade de Costa Rica em Guápiles e pela Escola de Matemática do Instituto Tecnológico da Costa Rica, nas competências digitais de professores de ensino primário e secundário que participaram nos eventos realizados entre 2011 e 2021. O estudo concentrou-se nos docentes com maior frequência de participação nesses encontros, seguindo os aspectos metodológicos do Marco Europeu para a Competência Digital de Educadores (DigCompEdu). De modo geral, os resultados destacam níveis importantes de competências digitais: nível B1 em Compromisso Profissional e Ensino e Aprendizagem, e nível B2 em Conteúdos Digitais. Entretanto, observou-se um nível incipiente na competência de Avaliação e Retroalimentação por meio de ferramentas digitais.",
      "keywords_es": [
        "Tecnologías de información y la matemática",
        "Matemática y educación secundaria",
        "Formación docente",
        "Competencias digitales"
      ],
      "keywords_en": [
        "Information technology and mathematics",
        "Mathematics and secondary education",
        "Teacher training",
        "Digital skills"
      ],
      "keywords_pt": [
        "Tecnologia da informação e matemática",
        "Matemática e educação secundária",
        "Formação de professores",
        "Competências digitais"
      ],
      "citation": "Jiménez-Castro, M., & Mena Esquivel, L. F. (2025). EREM: Aportes en competencias digitales al personal docente de matemática de la Región Caribe Norte de Costa Rica. Revista Digital: Matemática, Educación e Internet, 25(2). https://doi.org/10.18845/rdmei.v25i2.7542"
    },
    {
      "id": 2,
      "title": "Sistemas Lineales de Ecuaciones Diferenciales Fraccionarias",
      "title_en": "Linear Fractional Differential Equations Systems",
      "volume": 25,
      "number": 2,
      "language": "es",
      "published": "2025-03-01",
      "authors": [
        {
          "name": "Erika González Nava",
          "email": "15282707@uagro.mx",
          "university": "Universidad Autónoma de Guerrero",
          "location": "Guerrero, México",
          "orcid": "https://orcid.org/0009-0004-7484-6196"
        },
        {
          "name": "Martín P. Árciga Alejandre",
          "email": "mparciga@uagro.mx",
          "university": "Universidad Autónoma de Guerrero",
          "location": "Guerrero, México",
          "orcid": "https://orcid.org/0000-0002-1637-8513"
        },
        {
          "name": "Jorge Sánchez Ortiz",
          "email": "jsanchez@uagro.mx",
          "university": "Universidad Autónoma de Guerrero",
          "location": "Guerrero, México",
          "orcid": "https://orcid.org/0000-0002-9228-7285"
        },
        {
          "name": "Jorge A. Morales Buenaventura",
          "email": "18349939@uagro.mx",
          "university": "Universidad Autónoma de Guerrero",
          "location": "Guerrero, México",
          "orcid": "https://orcid.org/0009-0008-2680-5073"
        }
      ],
      "slug": "Articulos/V25/N2_2025/Gonzalez",
      "pdf": "/Articulos/V25/N2_2025/Gonzalez/RevistaDigital_V25_n2_2025_Gonzalez.pdf",
      "doi": "https://doi.org/10.18845/rdmei.v25i2.7603",
      "received": "12 de febrero de 2024",
      "accepted": "1 de agosto de 2024",
      "abstract_es": "Este trabajo se centra en la descripción cualitativa y cuantitativa de soluciones de sistemas lineales de ecuaciones diferenciales de orden fraccionario. La transformada de Laplace y la función Mittag-Leffler son las principales herramientas utilizadas para encontrar dichas soluciones. Como en el caso ordinario, los valores propios determinan la estabilidad del sistema mediante una condición que depende del orden de la derivada fraccionaria. Por último, se demuestra un teorema fundamental para los sistemas fraccionarios lineales y se dan algunos ejemplos particulares.",
      "abstract_en": "This paper focuses on the qualitative and quantitative description of solutions for linear systems of differential equations with fractional order. The Laplace transform and the Mittag-Leffler function are the main tools used to find such solutions. As in the ordinary case, the eigenvalues determine the stability of the system via a condition depending on the order of the fractional derivative. Finally, a fundamental theorem for linear fractional systems is proved and some particular examples are given.",
      "abstract_pt": "Este trabalho aborda a descrição qualitativa e quantitativa das soluções de sistemas lineares de equações diferenciais de ordem fracionária. A transformada de Laplace e a função Mittag-Leffler são as principais ferramentas utilizadas para encontrar tais soluções. Assim como no caso ordinário, os valores próprios determinam a estabilidade do sistema por meio de uma condição que depende da ordem da derivada fracionária. Por fim, demonstra-se um teorema fundamental para os sistemas lineares fracionários e são apresentados alguns exemplos particulares.",
      "keywords_es": [
        "Derivada de Caputo",
        "Transformada de Laplace",
        "Operador Mittag-Leffler"
      ],
      "keywords_en": [
        "Caputo derivative",
        "Laplace transform",
        "Mittag-Leffler operator"
      ],
      "keywords_pt": [
        "Derivada de Caputo",
        "Transformada de Laplace",
        "Operador Mittag-Leffler"
      ],
      "citation": "González Nava, E., Árciga Alejandre, M. P., Sánchez Ortiz, J., & Morales Buenaventura, J. A. (2025). Sistemas Lineales de Ecuaciones Diferenciales Fraccionarias. Revista Digital: Matemática, Educación e Internet, 25(2). https://doi.org/10.18845/rdmei.v25i2.7603"
    },
    {
      "id": 3,
      "title": "Algoritmo iterativo para calcular raíces cuadradas y cúbicas para estudiantes de educación media",
      "title_en": "Iterative algorithm to calculate square and cubic roots for secondary and high school students",
      "volume": 25,
      "number": 2,
      "language": "es",
      "published": "2025-03-01",
      "authors": [
        {
          "name": "Mario A. Sandoval-Hernández",
          "email": "marioalberto.sandoval.cb190@dgeti.sems.gob.mx",
          "university": "Centro de Bachillerato Tecnológico industrial y de servicios No.190",
          "location": "Boca del Río, Veracruz, México",
          "orcid": "https://orcid.org/0000-0002-5518-3858"
        },
        {
          "name": "Griselda J. Morales-Alarcón",
          "email": "zS21000480@estudiantes.uv.mx",
          "university": "Universidad Veracruzana",
          "location": "Xalapa, Veracruz, México",
          "orcid": "https://orcid.org/0000-0003-0142-0923"
        },
        {
          "name": "Gerardo C. Velez-López",
          "email": "cesar18f452@gmail.com",
          "university": "Instituto Nacional de Astrofísica, Óptica y Electrónica",
          "location": "Tonantzintla, Puebla, México",
          "orcid": "https://orcid.org/0000-0002-0726-1153"
        },
        {
          "name": "Víctor M. Jiménez-Fernández",
          "email": "vcjimenez@uv.mx",
          "university": "Universidad Veracruzana",
          "location": "Xalapa, Veracruz, México",
          "orcid": "https://orcid.org/0000-0003-1811-1238"
        },
        {
          "name": "Uriel A. Filobello-Niño",
          "email": "ufilobello@uv.mx",
          "university": "Universidad Veracruzana",
          "location": "Xalapa, Veracruz, México",
          "orcid": "https://orcid.org/0000-0002-3543-834X"
        },
        {
          "name": "Héctor Vázquez Leal",
          "email": "hvazquez@uv.mx",
          "university": "Universidad Veracruzana",
          "location": "Xalapa, Veracruz, México",
          "orcid": "https://orcid.org/0000-0002-7785-5272"
        }
      ],
      "slug": "Articulos/V25/N2_2025/Sandoval",
      "pdf": "/Articulos/V25/N2_2025/Sandoval/RevistaDigital_V25_n2_2025_Sandoval.pdf",
      "doi": "https://doi.org/10.18845/rdmei.v25i2.7604",
      "received": "9 de mayo de 2024",
      "accepted": "19 de setiembre de 2024",
      "abstract_es": "En este artículo se presenta una metodología didáctica basada en el algoritmo numérico de Newton-Raphson, diseñada para enseñar a estudiantes de educación media superior cómo calcular raíces cuadradas y cúbicas. El enfoque de esta metodología está basada en el criterio de paro de convergencia cuadrática de Newton-Raphson, permitiendo en dos iteraciones una precisión de hasta cuatro dígitos significativos o más en las raíces obtenidas. Asimismo, esta metodología puede apoyarse en la descomposición de factores para su aplicación. Además, se incluyen ejemplos numéricos frecuentemente propuestos a los alumnos de educación media, con el fin de brindarles práctica en la aplicación del algoritmo enseñado en escuelas secundarias y preparatorias. La aplicación de este algoritmo trae como beneficio estimular el cálculo mental en los estudiantes.",
      "abstract_en": "This article introduces a teaching methodology based on the Newton-Raphson numerical algorithm, specifically to teach for high school students in Mexico to learn how to compute square and cubic roots. The method relies on the Newton-Raphson algorithm's quadratic convergence stopping criterion, which achieves precision up to four significant digits in the roots calculated within just two iterations. Additionally, factor decomposition supports the application of this methodology. The article also includes numerical examples commonly given to middle school students, providing them with practical experience in using the algorithm as it is taught in secondary and high schools. Applying this algorithm helps enhance students' mental arithmetic skills, offering a significant educational benefit.",
      "abstract_pt": "Este artigo apresenta uma metodologia didática baseada no algoritmo numérico de Newton-Raphson, desenvolvida para ensinar estudantes do ensino médio a calcular raízes quadradas e cúbicas. A abordagem dessa metodologia baseia-se no critério de parada por convergência quadrática do algoritmo de Newton-Raphson, permitindo obter, em duas iterações, uma precisão de até quatro dígitos significativos ou mais nas raízes calculadas. Além disso, essa metodologia pode apoiar-se na decomposição de fatores para sua aplicação. O artigo também inclui exemplos numéricos frequentemente propostos a alunos do ensino médio, com o objetivo de proporcionar prática na aplicação do algoritmo ensinado em escolas secundárias e preparatórias. A aplicação desse algoritmo traz como benefício estimular o cálculo mental dos estudantes.",
      "keywords_es": [
        "Matemática educativa",
        "Alternativas de enseñanza",
        "Enseñanza media superior",
        "Aritmética",
        "Discurso matemático escolar"
      ],
      "keywords_en": [
        "Mathematics Education",
        "Teaching Alternatives",
        "High school",
        "Arithmetic",
        "School mathematical speech"
      ],
      "keywords_pt": [
        "Educação matemática",
        "Alternativas de ensino",
        "Ensino médio",
        "Aritmética",
        "Discurso matemático escolar"
      ],
      "citation": "Sandoval-Hernández, M. A., Morales-Alarcón, G. J., Velez-López, G. C., Jiménez-Fernández, V. M., Vázquez Leal, H., & Filobello-Niño, U. A. (2025). Algoritmo iterativo para calcular raíces cuadradas y cúbicas para estudiantes de educación media. Revista Digital: Matemática, Educación e Internet, 25(2). https://doi.org/10.18845/rdmei.v25i2.7604"
    },
    {
      "id": 4,
      "title": "Estudio de la relación entre la “actitud hacia la utilidad de la matemática” y la “autoconfianza matemática” en dos colegios costarricenses",
      "title_en": "Study of the relationship between “attitude towards the usefulness of mathematics” and “mathematical self-confidence” in two Costa Rican high schools",
      "volume": 25,
      "number": 2,
      "language": "es",
      "published": "2025-03-01",
      "authors": [
        {
          "name": "Robin Sequeira Solano",
          "email": "robinseq315@gmail.com",
          "university": "Investigador independiente",
          "location": "Cartago, Costa Rica",
          "orcid": "https://orcid.org/0009-0000-4808-8353"
        },
        {
          "name": "Jennany Ortiz Mata",
          "email": "jennany010900@gmail.com",
          "university": "Investigador independiente",
          "location": "Cartago, Costa Rica",
          "orcid": "https://orcid.org/0009-0002-0001-1191"
        },
        {
          "name": "Luis Gerardo Meza Cascante",
          "email": "gemeza@itcr.ac.cr",
          "university": "Instituto Tecnológico de Costa Rica",
          "location": "Cartago, Costa Rica",
          "orcid": "https://orcid.org/0000-0002-5413-0172"
        }
      ],
      "slug": "Articulos/V25/N2_2025/Sequeira",
      "pdf": "/Articulos/V25/N2_2025/Sequeira/RevistaDigital_V25_n2_2025_Sequeira.pdf",
      "doi": "https://doi.org/10.18845/rdmei.v25i2.7606",
      "received": "13 de enero de 2024",
      "accepted": "1 de octubre de 2024",
      "abstract_es": "En este estudio se investiga la relación entre la actitud hacia la utilidad de la matemática y la autoconfianza matemática en una muestra de 476 estudiantes de un colegio rural y otro urbano, ambos públicos y diurnos, en Costa Rica. Las variables se midieron utilizando las subescalas de Fennema y Sherman. Los resultados indican que los niveles de ambas variables son elevados, con un 87,4% del estudiantado mostrando una actitud positiva hacia la utilidad de la matemática y un 65,8% exhibiendo alta autoconfianza matemática. Se identificaron diferencias significativas en la autoconfianza matemática según el sexo, aunque no se observaron diferencias en la actitud hacia la utilidad de la matemática. Asimismo, se hallaron variaciones en ambas variables en función del tipo de colegio, destacándose que el colegio rural presentó los promedios más altos. No se encontraron diferencias significativas en ninguna de las variables según el nivel educativo. Finalmente, se detectó una relación positiva, débil y lineal entre la actitud hacia la utilidad de la matemática y la autoconfianza matemática.",
      "abstract_en": "This study investigates the relationship between attitude towards the usefulness of mathematics and mathematical self-confidence in a sample of 476 students from a rural high school and an urban high school, both public and daytime, in Costa Rica. The variables were measured using the Fennema and Sherman subscales. The results indicate that both variables present high levels, with 87.4% of students showing a positive attitude towards the usefulness of mathematics and 65.8% exhibiting high mathematical self-confidence. Significant differences were identified in mathematical self-confidence according to sex, although no differences were observed in attitude towards the usefulness of mathematics. Likewise, variations in both variables were found according to the type of school, with rural schools showing the highest averages. No significant differences were found according to educational level. Finally, a positive, weak and linear relationship was detected between attitude towards the usefulness of mathematics and mathematical self-confidence.",
      "abstract_pt": "Este estudo investiga a relação entre a atitude em relação à utilidade da matemática e a autoconfiança matemática em uma amostra de 476 estudantes de uma escola rural e outra urbana, ambas públicas e diurnas, na Costa Rica. As variáveis foram medidas utilizando as subescalas de Fennema e Sherman. Os resultados indicam que ambas as variáveis apresentam níveis elevados, com 87,4% dos estudantes mostrando uma atitude positiva em relação à utilidade da matemática e 65,8% exibindo alta autoconfiança matemática. Identificaram-se diferenças significativas na autoconfiança matemática segundo o sexo, embora não tenham sido observadas diferenças na atitude em relação à utilidade da matemática. Também foram encontradas variações em ambas as variáveis de acordo com o tipo de escola, destacando-se que a escola rural apresentou as médias mais altas. Não foram encontradas diferenças significativas em nenhuma das variáveis segundo o nível educativo. Por fim, foi detectada uma relação positiva, fraca e linear entre a atitude em relação à utilidade da matemática e a autoconfiança matemática.",
      "keywords_es": ["Actitud", "Autoconfianza", "Utilidad", "Matemática"],
      "keywords_en": [
        "Attitude",
        "Self-confidence",
        "Usefulness",
        "Mathematics"
      ],
      "keywords_pt": ["Atitude", "Autoconfiança", "Utilidade", "Matemática"],
      "citation": "Sequeira Solano, R., Ortiz Mata, J., & Meza Cascante, L. G. (2025). Estudio de la relación entre la “actitud hacia la utilidad de la matemática” y la “autoconfianza matemática” en dos colegios costarricenses. Revista Digital: Matemática, Educación e Internet, 25(2). https://doi.org/10.18845/rdmei.v25i2.7606"
    },
    {
      "id": 5,
      "title": "Rotaciones y cuaterniones (sin secretos)",
      "title_en": "Rotations and quaternions: The easy and convenient way",
      "volume": 25,
      "number": 2,
      "language": "es",
      "published": "2025-03-01",
      "authors": [
        {
          "name": "Walter Mora Flores",
          "email": "wmora2@gmail.com",
          "university": "Investigador independiente",
          "location": "Alajuela, Costa Rica",
          "orcid": "https://orcid.org/0009-0008-8770-3417"
        }
      ],
      "category": "Didáctica y software",
      "slug": "Articulos/V25/N2_2025/Mora",
      "pdf": "/Articulos/V25/N2_2025/Mora/RevistaDigital_V25_n2_2025_Mora.pdf",
      "doi": "https://doi.org/10.18845/rdmei.v25i2.7274",
      "received": "8 de febrero de 2024",
      "accepted": "10 de mayo de 2024",
      "abstract_es": "Hay mucha literatura dispersa sobre cuaterniones y rotaciones que está orientada a aplicaciones prácticas pero no tanto a desarrollar la intuición y las matemáticas que hay detrás de las fórmulas. En este artículo partimos de los conocimientos básicos comunes de los cursos de Álgebra Lineal y se introducen los cuaterniones y su aplicación en rotaciones, siguiendo un flujo natural, teórico, práctico e intuitivo. El conjunto de cuaterniones, denotado H, es un espacio vectorial isomorfo a R4 y se define una multiplicación que le da estructura de campo no conmutativo. La multiplicación por un cuaternión unitario aplica una rotación en dos planos, de manera simultánea, de una manera similar a como la multiplicación por un número complejo unitario aplica una rotación. Para usar este hecho en rotaciones en R3, escogemos una base ortonormal de H adecuada (esto nos da dos planos), de tal manera que en un plano se fije el eje de rotación (es decir, no hay rotación) y en el otro plano se aplique la rotación deseada.",
      "abstract_en": "There is a lot of scattered literature on quaternions and rotations that is oriented to practical applications but not so much to develop the intuition and mathematics behind the formulas. In this paper we start from the common basic knowledge of Linear Algebra courses and introduce quaternions and their application in rotations, following a natural, theoretical, practical and intuitive flow. The set of quaternions, denoted H, is a vector space isomorphic to R4 and a multiplication is defined which gives it a non-commutative field structure. Multiplication by a unitary quaternion applies a rotation in two planes, in a simultaneous manner, in a similar way as multiplication by a unitary complex number applies a rotation. To use this fact in rotations in R3, we choose a suitable orthonormal basis of H (this gives us two planes), such that in one plane the axis of rotation is fixed (i.e., no rotation) and in the other plane the desired rotation is applied.",
      "abstract_pt": "Há muita literatura dispersa sobre quaternions e rotações que está orientada a aplicações práticas, mas não tanto ao desenvolvimento da intuição e da matemática por trás das fórmulas. Neste artigo, partimos dos conhecimentos básicos comuns dos cursos de Álgebra Linear e introduzimos os quaternions e sua aplicação em rotações, seguindo um fluxo natural, teórico, prático e intuitivo. O conjunto dos quaternions, denotado por H, é um espaço vetorial isomorfo a R4, e define-se uma multiplicação que lhe confere estrutura de corpo não comutativo. A multiplicação por um quaternion unitário aplica uma rotação em dois planos, de forma simultânea, de maneira similar à multiplicação por um número complexo unitário. Para utilizar esse fato em rotações em R3, escolhemos uma base ortonormal adequada de H (o que nos dá dois planos), de tal forma que em um plano o eixo de rotação permaneça fixo (ou seja, sem rotação) e no outro plano seja aplicada a rotação desejada.",
      "keywords_es": [
        "Rotaciones",
        "Interpolación",
        "Cuaterniones",
        "Álgebra Lineal"
      ],
      "keywords_en": ["Rotations", "Interpolation", "Linear Algebra"],
      "keywords_pt": [
        "Rotações",
        "Interpolação",
        "Quaternions",
        "Álgebra Linear"
      ],
      "citation": "Mora F., W. (2025). Rotaciones y cuaterniones (sin secretos). Revista Digital: Matemática, Educación e Internet, 25(2). https://doi.org/10.18845/rdmei.v25i2.7274"
    },
    {
      "id": 6,
      "title": "Algunos cálculos sobre los primos de Sheldon: variaciones a una conjetura",
      "title_en": "Some computations about Sheldon primes: variations on a conjecture",
      "volume": 25,
      "number": 2,
      "language": "es",
      "published": "2025-03-01",
      "authors": [
        {
          "name": "Gerardo Miramontes de León",
          "email": "gmiram@ieee.org",
          "university": "Universidad Autónoma de Zacatecas",
          "location": "Zacatecas, México",
          "orcid": "https://orcid.org/0000-0001-5015-9982"
        }
      ],
      "category": "Didáctica y software",
      "slug": "Articulos/V25/N2_2025/Miramontes",
      "pdf": "/Articulos/V25/N2_2025/Miramontes/RevistaDigital_V25_n2_2025_Miramontes.pdf",
      "doi": "https://doi.org/10.18845/rdmei.v25i2.7602",
      "received": "15 de abril de 2024",
      "accepted": "5 de agosto de 2024",
      "abstract_es": "La conjetura de Sheldon despierta el interés por encontrar posibles relaciones entre el producto de los dígitos de un número primo $p_n$ y su índice $n$. En este trabajo se muestra, en un ejercicio numérico, que dicha conjetura podría explicarse por el comportamiento cuasi-cíclico ascendente del producto de los dígitos que forman a $p_n$. Se encontró que el producto de los dígitos de $p_n$ no puede relacionarse matemáticamente al índice $n$ por varias razones, las cuales se exponen en este trabajo. Además, se reflexiona si dicha conjetura, basada en la observación de una coincidencia, podría modificarse al considerar un reordenamiento del índice de los números primos.",
      "abstract_en": "Sheldon's conjecture arouses interest in finding possible relationships between the product of the digits of a prime number $p_n$ and its index $n$. This work shows, in a numerical exercise, that this conjecture could be explained by the quasi-cyclical ascending behavior of the product of the digits that make up $p_n$. It was found that the product of the digits of $p_n$ cannot be mathematically related to the index $n$ for several reasons, which are explained in this work. Furthermore, we reflect on whether this conjecture, based on the observation of a coincidence, could be modified by considering a rearrangement of the index of the prime numbers.",
      "abstract_pt": "A conjectura de Sheldon desperta interesse em encontrar possíveis relações entre o produto dos dígitos de um número primo $p_n$ e seu índice $n$. Neste trabalho, mostra-se, por meio de um exercício numérico, que essa conjectura poderia ser explicada pelo comportamento quase cíclico ascendente do produto dos dígitos que compõem $p_n$. Verificou-se que o produto dos dígitos de $p_n$ não pode ser relacionado matematicamente ao índice $n$ por várias razões, as quais são apresentadas neste estudo. Além disso, reflete-se sobre a possibilidade de modificar essa conjectura, baseada na observação de uma coincidência, ao considerar um rearranjo do índice dos números primos.",
      "keywords_es": ["Conjetura", "Números primos", "Primos de Sheldon"],
      "keywords_en": ["Conjecture", "Prime numbers", "Sheldon primes"],
      "keywords_pt": ["Conjetura", "Números primos", "Primos de Sheldon"],
      "citation": "Miramontes, G. (2025). Algunos cálculos sobre los primos de Sheldon: variaciones a una conjetura. Revista Digital: Matemática, Educación e Internet, 25(2). https://doi.org/10.18845/rdmei.v25i2.7602"
    },
    {
      "id": 7,
      "title": "¿Haciendo trampa o aprendiendo? ChatGPT en la enseñanza de la función lineal",
      "title_en": "Cheating or learning? ChatGPT in Teaching Linear Function",
      "volume": 25,
      "number": 2,
      "language": "es",
      "published": "2025-03-01",
      "authors": [
        {
          "name": "José Pablo Calderón Gairaud",
          "email": "jose03pc@gmail.com",
          "university": "Universidad de Puerto Rico",
          "location": "Mayagüez, Puerto Rico",
          "orcid": "https://orcid.org/0009-0001-7381-5134"
        },
        {
          "name": "Cristhian Chavez Montoya",
          "email": "acrismontoya@gmail.com",
          "university": "Investigador independiente",
          "location": "Alajuela, Costa Rica",
          "orcid": "https://orcid.org/0009-0009-2090-8247"
        }
      ],
      "category": "Didáctica y software",
      "slug": "Articulos/V25/N2_2025/Calderon",
      "pdf": "/Articulos/V25/N2_2025/Calderon/RevistaDigital_V25_n2_2025_Calderon.pdf",
      "doi": "https://doi.org/10.18845/rdmei.v25i2.7753",
      "received": "3 de diciembre de 2023",
      "accepted": "5 de agosto de 2024",
      "abstract_es": "El siguiente artículo presenta un marco conceptual referente a las inteligencias artificiales, una breve descripción sobre lo que es ChatGPT, su impacto en la educación desde su lanzamiento, además de un resumen de las ventajas y desventajas de utilizar este tipo de IA en el aprendizaje de conceptos y/o nociones matemáticas. A raíz de este análisis se plantea una propuesta didáctica que consiste en una guía de trabajo independiente que involucra discusión interactiva y resolución de problemas utilizando ChatGPT, para abarcar los contenidos referentes a función lineal de 10° nivel del programa de estudios de matemáticas según el Ministerio de Educación Pública de Costa Rica. Se presenta una visión general sobre las implicaciones al utilizar ChatGPT en el estudio de la función lineal y los retos que se presentan al intentar implementarlo en el sistema educativo costarricense. Además, se describe la experiencia sobre la aplicación de la propuesta en una institución ubicada en Cartago en dos ocasiones, la primera ayudó a realizar mejoras en la propuesta y la segunda contribuyó a consolidar el diseño final de las correcciones. Se destaca que el uso de herramientas como ChatGPT aporta como acompañamiento estudiantil para mejorar la comprensión de los contenidos, sin embargo, no sustituye el trabajo realizado por un docente y la atención que este brinda.",
      "abstract_en": "The following article presents a conceptual framework regarding artificial intelligence, a description of what ChatGPT is, its impact on education since its launch, as well as a summary of the advantages and disadvantages of using this type of AI in learning concepts and/or mathematical notions. As a result of this analysis, a didactic proposal is presented, consisting of an independent work guide that involves interactive discussion and problem-solving using ChatGPT, to cover the contents related to the linear function of the 10th level of the mathematics study program according to the Ministry of Public Education of Costa Rica. An overview of the implications of using ChatGPT in the study of the Linear Function and the challenges that arise when trying to implement it in the Costa Rican educational system is presented. In addition, the experience on the application of the proposal in an institution located in Cartago on two occasions is described, the first one helped to make improvements in the proposal, and the second contributed to consolidate the final design of the corrections. It is highlighted that the use of tools such as ChatGPT provides student support to improve the understanding of the contents; however, it does not replace the work done by a teacher and the attention that can be provided.",
      "abstract_pt": "O seguinte artigo apresenta um marco conceitual referente às inteligências artificiais, uma breve descrição sobre o que é o ChatGPT, seu impacto na educação desde o seu lançamento, além de um resumo das vantagens e desvantagens de utilizar esse tipo de IA na aprendizagem de conceitos e/ou noções matemáticas. A partir dessa análise, propõe-se uma proposta didática que consiste em um guia de trabalho independente que envolve discussão interativa e resolução de problemas utilizando o ChatGPT, para abranger os conteúdos referentes à função linear do 10º nível do programa de estudos de matemática segundo o Ministério da Educação Pública da Costa Rica. Apresenta-se uma visão geral sobre as implicações do uso do ChatGPT no estudo da função linear e os desafios que surgem ao tentar implementá-lo no sistema educacional costarriquenho. Além disso, descreve-se a experiência da aplicação da proposta em uma instituição localizada em Cartago em duas ocasiões, sendo que a primeira ajudou a realizar melhorias na proposta e a segunda contribuiu para consolidar o desenho final das correções. Destaca-se que o uso de ferramentas como o ChatGPT oferece apoio estudantil para melhorar a compreensão dos conteúdos; no entanto, não substitui o trabalho realizado por um docente nem a atenção que este pode oferecer.",
      "keywords_es": [
        "ChatGPT",
        "Guía de trabajo",
        "Función lineal",
        "Inteligencia artificial",
        "Enseñanza"
      ],
      "keywords_en": [
        "ChatGPT",
        "Self-Study Guide",
        "Linear Function",
        "Artificial Intelligence"
      ],
      "keywords_pt": [
        "ChatGPT",
        "Guia de estudo",
        "Função linear",
        "Inteligência artificial"
      ],
      "citation": "Calderón Gairaud, J., & Chavez Montoya, C. (2025). ¿Haciendo trampa o aprendiendo? ChatGPT en la enseñanza de la función lineal. Revista Digital: Matemática, Educación e Internet, 25(2). https://doi.org/10.18845/rdmei.v25i2.7753"
    },
    {
      "id": 7,
      "title": "GeoGebra as a Potential Tool for Exploring the Concepts of Continuity and Convergence",
      "title_en": "GeoGebra as a Potential Tool for Exploring the Concepts of Continuity and Convergence",
      "volume": 25,
      "number": 2,
      "language": "en",
      "published": "2025-03-01",
      "authors": [
        {
          "name": "André Luiz Araújo da Costa",
          "email": "and.costa@uece.br",
          "university": "Universidade Estadual do Ceará - UECE",
          "location": "Fortaleza, Brasil",
          "orcid": "https://orcid.org/0000-0003-1155-4204"
        },
        {
          "name": "Francisco Régis Vieira Alves",
          "email": "fregis@ifce.edu.br",
          "university": "Instituto Federal de Educação, Ciência e Tecnologia do Ceará - IFCE",
          "location": "Fortaleza, Brasil",
          "orcid": "https://orcid.org/0000-0003-3710-1561"
        }
      ],
      "category": "Didáctica y software",
      "slug": "Articulos/V25/N2_2025/Araujo",
      "pdf": "/Articulos/V25/N2_2025/Araujo/RevistaDigital_V25_n2_2025_Araujo.pdf",
      "doi": "https://doi.org/10.18845/rdmei.v25i2.7821",
      "received": "20 de septiembre de 2024",
      "accepted": "10 de diciembre de 2024",
      "abstract_es": "Este artículo ejemplifica el potencial de GeoGebra como recurso didáctico para la enseñanza del Análisis Real y Complejo. Para ser más precisos, nuestro objetivo principal es demostrar lo útil que es GeoGebra al proporcionar un enfoque visual para entender los conceptos de continuidad, equicontinuidad y la convergencia de secuencias de funciones reales de dos variables y funciones complejas de una variable. La complejidad de la definición de estos conceptos, que dependen de varios parámetros como los clásicos delta y épsilon, motivó la elección del tema de este artículo. Además, su conexión con el Teorema de Ascoli-Arzelà, que es significativo en muchas áreas de las matemáticas, también influyó en esta decisión. A lo largo del artículo, presentamos algunos applets desarrollados con GeoGebra que permiten una exploración satisfactoria de esos conceptos según nuestro análisis. Esta exploración se realiza a lo largo de una secuencia de ejemplos y contraejemplos para los conceptos de continuidad, equicontinuidad y convergencia tratados. En el Apéndice, proporcionamos algunas instrucciones para diseñar los applets utilizados a lo largo del texto.",
      "abstract_en": "The following paper exemplifies the potential of GeoGebra as a didactic resource for teaching Real and Complex Analysis. More precisely, our main goal is to demonstrate how useful GeoGebra is in providing a visual approach to understanding the concepts of continuity, equicontinuity, and the convergence of sequences of real functions of two variables and complex functions of a single variable. The complexity of the definition of these concepts, which rely on various parameters such as the classical delta and epsilon, motivated the choice of the subject of this article. Moreover, their connection to the Ascoli–Arzelà Theorem, which is significant in many areas of mathematics, also influenced this decision. Throughout the paper, we present some applets developed using GeoGebra which allow for a satisfactory exploration of these concepts according to our analysis. This exploration is done through a sequence of examples and counterexamples for the concepts of continuity, equicontinuity, and convergence addressed. In the Appendix, we provide some instructions for designing the applets used throughout the text.",
      "abstract_pt": "Este artigo exemplifica o potencial do GeoGebra como recurso didático para o ensino de Análise Real e Complexa. Mais precisamente, nosso objetivo principal é demonstrar o quão útil é o GeoGebra ao fornecer uma abordagem visual para compreender os conceitos de continuidade, equicontinuidade e a convergência de sequências de funções reais de duas variáveis e funções complexas de uma variável. A complexidade da definição desses conceitos, que dependem de diversos parâmetros como os clássicos delta e épsilon, motivou a escolha do tema deste artigo. Além disso, sua conexão com o Teorema de Ascoli–Arzelà, significativo em muitas áreas da matemática, também influenciou essa decisão. Ao longo do artigo, apresentamos alguns applets desenvolvidos com GeoGebra que permitem uma exploração satisfatória desses conceitos segundo nossa análise. Essa exploração ocorre por meio de uma sequência de exemplos e contraexemplos para os conceitos de continuidade, equicontinuidade e convergência abordados. No Apêndice, fornecemos algumas instruções para projetar os applets utilizados ao longo do texto.",
      "keywords_es": [
        "GeoGebra",
        "Visualización",
        "Análisis Real y Complejo",
        "Equicontinuidad"
      ],
      "keywords_en": [
        "GeoGebra",
        "Visualization",
        "Real and Complex Analysis",
        "Equicontinuity"
      ],
      "keywords_pt": [
        "GeoGebra",
        "Visualização",
        "Análise Real e Complexa",
        "Equicontinuidade"
      ],
      "citation": "Araújo da Costa, A. L., & Vieira Alves, F. R. (2025). GeoGebra as a Potential Tool for Exploring the Concepts of Continuity and Convergence: GeoGebra como una Herramienta Potencial para Explorar los Conceptos de Continuidad y Convergencia. Revista Digital: Matemática, Educación E Internet, 25(2). https://doi.org/10.18845/rdmei.v25i2.7821"
    }
  ]
}
