<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">

<HTML>
<HEAD>
<TITLE>Ejercicios</TITLE>
<META NAME="description" CONTENT="ejer2">
<META NAME="keywords" CONTENT="ejer2">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="Microsoft FrontPage 4.0">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="ejer2.css">

<LINK REL="next" HREF="node1.html">
</HEAD>

<BODY >

<OL>
<LI>¿Cu&#225;ntos n&#250;meros de placa podr&#225;n construirse si se utilizan 2 letras al inicio y 3
d&#237;gitos al final?

<P>
</LI>
<LI>¿Cu&#225;ntos n&#250;meros de placa podr&#225;n construirse si se utilizan 2 letras al inicio y 3
d&#237;gitos al final, pero no se admiten que se repitan ni letras ni d&#237;gitos?

<P>
</LI>
<LI>¿Cu&#225;ntos n&#250;meros de placa podr&#237;an construirse si se utilizan 2 letras al inicio y 3
d&#237;gitos al final, pero si la combinaci&#243;n de letras `CR' no debe utilizarse.

<P>
</LI>
<LI>¿Cu&#225;ntas placas podr&#237;an construirse si deben incluirse 2 letras iniciales y hasta un
m&#225;ximo de 3 d&#237;gitos al final?

<P>
</LI>
<LI>Entre los d&#237;gitos 1, 2, 3, 4 y 5 se escoge el primero, luego se hace una segunda selecci&#243;n
entre los otros cuatro. Sup&#243;ngase que los veinte resultados posibles tienen la misma
probabilidad. Encontrar la probabilidad de que un d&#237;gito impar sea seleccionado: a) la primer vez;
b) la segunda vez; c) ambas veces.

<P>
</LI>
<LI>Considere los 24 arreglos (permutaciones) posibles de los s&#237;mbolos 1, 2, 3 y 4 y asigne la
probabilidad de<!-- MATH
 $\frac{1}{24}$
 --> 1/24 a cada uno. Sea <I>A</I><SUB>i</SUB> el evento que el d&#237;gito <I>i</I> aparezca en su
lugar natural (donde <!-- MATH
 $i=1, 2, 3, 4$
 -->
<I>i</I> = 1, 2, 3, 4). Verifique la f&#243;rmula <!-- MATH
 $P\{A_1\cup
A_2\}=P\{A_1\}+P\{A_2\}-P\{A_1\cap A_2\}$
 -->
  <b>
<I>P</I>{<I>A</I><SUB>1</SUB> <IMG
 WIDTH="15" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="img2.gif"
 ALT="$ \cup$"> <I>A</I><SUB>2</SUB>} = <I>P</I>{<I>A</I><SUB>1</SUB>} + <I>P</I>{<I>A</I><SUB>2</SUB>} - <I>P</I>{<I>A</I><SUB>1</SUB> <IMG
 WIDTH="15" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="img3.gif"
 ALT="$ \cap$"> <I>A</I><SUB>2</SUB>}</b>.

<P>
</LI>
<LI>Se lanza una moneda hasta que aparezca por primera vez el mismo resultado dos veces
sucesivas. Asigne la probabilidad 1/2<SUP>n - 1</SUP> a cada resultado posible en que intervengan <I>n</I>
tiradas. Encuentre la probabilidad de los siguientes eventos: a) el experimento termina antes de
la sexta tirada; b) se requiere un n&#250;mero <EM>par</EM> de tiradas.

<P>
</LI>
<LI>Se arrojan dos dados. Sea <I>A</I> el evento de que las sumas de las caras es impar, <I>B</I> el evento
de que sale por lo menos un uno. Describa los eventos <b> <I>A</I> <IMG
 WIDTH="15" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="img3.gif"
 ALT="$ \cap$"> <I>B</I>, <I>A</I> <IMG
 WIDTH="15" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="img2.gif"
 ALT="$ \cup$"> <I>B</I> y <!-- MATH
 $A\cap \overline B$
 -->
<I>A</I> <IMG
 WIDTH="15" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="img3.gif"
 ALT="$ \cap$">  </b> <IMG
 WIDTH="17" HEIGHT="17" ALIGN="BOTTOM" BORDER="0"
 SRC="img4.gif"
 ALT="$ \overline{B}$">.
Encuentre sus probabilidades si suponemos que los 36 puntos muestrales tienen probabilidades
iguales.

<P>
</LI>
<LI>Sean <I>A</I>, <I>B</I> y <I>C</I> tres eventos arbitrarios. Encontrar expresiones de los eventos en que de
<I>A</I>, <I>B</I>, <I>C</I>:

&nbsp;

<OL type="a">
<LI>Solamente ocurre <I>A</I>.
</LI>
<LI>Ocurren tanto <I>A</I> como <I>B</I>, pero no <I>C</I>.
</LI>
<LI>Los tres eventos ocurren.
</LI>
<LI>Ocurre por lo menos uno.
</LI>
<LI>Por lo menos dos ocurren.
</LI>
<LI>Ocurre uno, y no m&#225;s.
</LI>
<LI>Ourren dos, y no m&#225;s.
</LI>
<LI>No ocurre ninguno.
</LI>
<LI>No ocurren m&#225;s de dos.
</LI>
</OL>

<P>
</LI>
<LI>Se van a distribuir <I>a</I> caramelos, <I>b</I> melcochas y <I>c</I> chocolates entre
<I>a</I> + <I>b</I> + <I>c</I> personas. Si la repartici&#243;n se hace al azar y cada persona recibe exactamente un dulce,
de cu&#225;ntas maneras pueden distribuirse los dulces entre ellos?
<P>
</LI>
<LI>Una costura que se practica con regularidad en los aviones necesita
25 remaches. Si alg&#250;n remache de los utilizados en la costura est&#225; defectuoso la costura
deber&#225; rehacerse. La probabilidad de que un remache este defectuoso es constante e independiente
de si los otros remaches los son.<br>
  ¿Cu&#225;l debe ser la probabilidad de que un remache sea defectuoso, para garantizar que  a lo sumo
el 10% de las costuras deben rehacerse?
<P>
</LI>
<LI>Las consultas a un sistema de computadores en l&#237;nea, llegan a trav&#233;s de
5 l&#237;neas de comunicaci&#243;n. Los porcentajes de mensajes recibidos por la l&#237;nea 1, 2, 3, 4
y 5 son 20, 30, 10, 15 y 25, respectivamente. Las probabilidades de que un mensaje por la
l&#237;nea 1, 2, 3, 4 y 5 sean superiores a 100 caracteres son de 0.4, 0.6, 0.2, 0.8 y 0.9.
Cu&#225;l es la probabilidad de que una consulta  elegida al azar exceda los 100 caracteres? Si una
consulta elegida al azar tiene mas de 100 caracteres, cu&#225;l es la probabilidad de que haya
llegado por alguna de las l&#237;neas 3 o 4?

<P>
</LI>
<LI>Suponga que cierto departamento tiene tres terminales sin buffer, que
pueden ser conectadas a un computador por medio de dos l&#237;neas de comunicaci&#243;n. La Terminal 1
tiene su propia l&#237;nea de uso, mientras que las Terminales 2 y 3 comparten una l&#237;nea de
comunicaci&#243;n, de manera que a lo sumo
 una de ellas puede  estar usando la l&#237;nea en un momento determinado. Durante
un d&#237;a de trabajo  la terminal 1 se utiliza 30 minutos por cada hora, la terminal 2 es usada
10 minutos por hora y la terminal 3 se usa solo 5 minutos de cada hora, todos estos tiempos en
promedio. Asumiendo que las l&#237;neas operan en forma independiente, cu&#225;l es la probabilidad
de que por lo menos una terminal est&#233; en operaci&#243;n en un momento aleatorio, durante el d&#237;a
de trabajo? Si la operaci&#243;n de las dos l&#237;neas no es independiente con probabilidades
condicionales de 1/3 de que la terminal 2 este en operaci&#243;n dado que la 1 lo est&#225; y  de 1/12 de
que la terminal 3 este en operaci&#243;n dado que la 1 lo est&#225;, cu&#225;l es la probabilidad de que
al menos una de las tres l&#237;neas este en uso?

<P>
</LI>
<LI>Encuentre la probabilidad de obtener cada una de las siguientes
manos de p&#243;ker:

<OL type="a">
<LI>Escalerilla limpia (cinco cartas en secuencia de un solo palo,
pero no en escalerilla real [10, J, Q, K, A]. Como el A tambi&#233;n se cuenta como uno, la secuencia
A, 2, 3, 4, 5 es tambi&#233;n una escalerilla limpia).
</LI>
<LI>Cuatro cartas del mismo valor.
</LI>
<LI>Casa llena (un par y un triple del mismo valor, por ejemplo A, A,
K, K, K).
</LI>
<LI>Cinco cartas del mismo palo, pero no en escalerilla.
</LI>
<LI>Escalerilla (cinco cartas en secuencia, pero no del mismo palo).
</LI>
</OL>
  <p>&nbsp;
</LI>
<LI>Encuentre la probabilidad de <EM>no</EM> obtener un par en p&#243;ker.
<P>
</LI>
<LI>Para el p&#243;ker, calcule la probabilidad de obtener:

<OL type="a">
<LI>exactamente un par
</LI>
<LI>dos pares
</LI>
<LI>un triple.
</LI>
</OL>
<P>
</LI>
<LI>Suponga que <I>A</I> y <I>B</I> son eventos independientes. Pruebe que:

<OL>
<LI><I><b>A</b></I> y <!-- MATH
 $\overline B$
 -->
<IMG
 WIDTH="17" HEIGHT="17" ALIGN="BOTTOM" BORDER="0"
 SRC="img4.gif"
 ALT="$ \overline{B}$"> son independientes
</LI>
<LI><!-- MATH
 $\overline A$
 -->
<IMG
 WIDTH="16" HEIGHT="17" ALIGN="BOTTOM" BORDER="0"
 SRC="img5.gif"
 ALT="$ \overline{A}$"> y <!-- MATH
 $\overline B$
 -->
<IMG
 WIDTH="17" HEIGHT="17" ALIGN="BOTTOM" BORDER="0"
 SRC="img4.gif"
 ALT="$ \overline{B}$"> son independientes.
</LI>
</OL>
<P>
</LI>
<LI>Suponga que una mano de ocho cartas est&#225; formada por las K's y las
Q's de una mano de naipe. Se toman dos cartas de dicha mano. Muestre que de los siguientes
eventos, <EM>no</EM> existen dos que sean independientes. A: Al menos una de las cartas es negra. B:
Una de las cartas es la Q de espadas. C: Ambas cartas son K's. D: Ambas cartas son Q's.
<P>
</LI>
<LI>Pruebe que <b> <I>P</I>[<I>A</I>| <I>B</I>] = 1 </b> si y solo si <b> <I>P</I>[<I>B</I>] <IMG
 WIDTH="16" HEIGHT="29" ALIGN="MIDDLE" BORDER="0"
 SRC="img6.gif"
 ALT="$ \neq$"> 0 y
<!-- MATH
 $P[\overline A\cup B]=0$
 -->
<I>P</I>[<IMG
 WIDTH="16" HEIGHT="17" ALIGN="BOTTOM" BORDER="0"
 SRC="img5.gif"
 ALT="$ \overline{A}$"> <IMG
 WIDTH="15" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="img2.gif"
 ALT="$ \cup$"> <I>B</I>] = 0</b>.
<P>
</LI>
<LI>Suponga que se toman dos cartas de la mano considerada en el
ejercicio 18. Calcule:

<OL type="a">
<LI>la probabilidad de que las dos cartas sean Q's, sabiendo que una de
ellas es una Q
</LI>
<LI>la probabilidad de que ambas cartas sean Q's, sabiendo que una de
ellas es una Q roja
</LI>
<LI>la probabilidad de que ambas sean Q's, sabiendo que una de ellas
es la Q de corazones.
</LI>
</OL>
<P>
</LI>
<LI>Se estima que respecto al  Parque Nacional de Diversiones,
72% de los visitantes va al Tobog&#225;n de Agua, el 56% se monta en las Diligencias, el 60% se
arriesga en el Hurac&#225;n, 50% va al Tobog&#225;n de agua y se monta en las Diligencias, 45% va al
Tobog&#225;n de Agua y al Hurac&#225;n, 40 % toma las Diligencias y el Hurac&#225;n y 30% disfruta de las
tres cosas. Asumiendo que los resultados de Poisson son correctos, calcule la probabilidad de que
un visitante Parque  Nacional de Diversiones:

<OL>
<LI>Disfrute al menos uno de los tres juegos
</LI>
<LI>Tome las diligencias sabiendo que ya tomo el Tobog&#225;n de
agua.
</LI>
<LI>Suba al Hurac&#225;n sabiendo que se ya disfrut&#243; de los otros dos
juegos.
</LI>
</OL>

<P>
</LI>
<LI>En una ventanilla de atenci&#243;n al publico de una empresa estatal se trabaja de 8 am. a 4pm. De 8 a 10 de la ma&#241;ana, por el caf&#233; la atenci&#243;n es mala y se sabe que el 40% de los atendidos salen descontentos, de 10 a 12 s&#243;lo el 15% de los atendidos
salen descontentos. Entre las 12 y las 2 el 20% queda descontento y entre las 2 y las 4 el 45%
de los atendidos sale descontento. Si usted en la noche se encuentra un amigo que ese mismo d&#237;a ha sido atendido y est&#225; molesto
con la atenci&#243;n, cu&#225;l es la probabilidad de que haya ido a esa ventanilla entre las 10 y las
12?

<P>
</LI>
<LI>Siete terminales de un sistema  est&#225;n conectadas
por una l&#237;nea de comunicaci&#243;n a una computadora. Exactamente cuatro de las siete
computadoras est&#225;n listas para transmitir un mensaje. Asuma que cada terminal tiene la misma
probabilidad de estar lista. Sea <I>X</I> la variable aleatoria cuyo valor es en n&#250;mero de terminales
que deben consultarse hasta encontrar la primera terminal lista.

<OL type="a">
<LI>Qu&#233; valores puede tomar <I>X</I>?
</LI>
<LI>Cu&#225;l es la distribuci&#243;n de probabilidad para <I>X</I>.(Las terminales se
consultan en secuencia sin repetici&#243;n)
</LI>
<LI>Suponga que la l&#237;nea de comunicaci&#243;n tiene <I>m</I> l&#237;neas conectadas,
de las cuales <I>n</I> est&#225;n listas para transmitir <I>n</I> <IMG
 WIDTH="16" HEIGHT="28" ALIGN="MIDDLE" BORDER="0"
 SRC="img7.gif"
 ALT="$ \geq$"> 1. Bajo esta premisa, resuelva las
preguntas a) y b).
</LI>
</OL>

<P>
<BR>
<BR>

<P>
En los siguientes tres ejercicios se considerar&#225; el problema de la correspondencia, conocido
algunas veces como <EM>el problema de Montmort</EM>. El problema es equivalente al siguiente. Una
jarra contiene <I>n</I> bolas numeradas de 1 a <I>n</I>. Las bolas son mezcladas y sacadas  una a la
vez. Cu&#225;l es la probabilidad de que ninguna bola sea sacada en el orden de su etiqueta? Es
decir, no ocurre que en la   <I>i</I> -&#233;sima extracci&#243;n,  la bola n&#250;mero <EM>i</EM> es sacada.

<P>
Otra versi&#243;n  es la siguiente: <I>n</I> cartas son digitadas para <I>n</I> personas, se ponen las
direcciones en <I>n</I> sobres. Las cartas se colocan al azar en los sobres. La pregunta entonces es
cu&#225;l es la probabilidad que ninguna de las direcciones reciba la carta correcta. En otra
versi&#243;n,  la versi&#243;n de los sombreros mezclados, <I>n</I> hombres guardan sus sombreros. Cuando
cada uno de ellos reclama su sombrero, se les entrega uno al azar de los que quedan.

<P>
Todas las versiones del problema de correspondencia pueden ser modelados de la siguiente manera:
hay <I>n</I> urnas y <I>n</I> bolas numeradas,  cada bola se pone en una urna. Una correspondencia ocurre
si la bola <I>k</I> se pone en la urna <I>k</I>. Denominaremos <I>A</I><SUB>k</SUB> al evento en el cual existe una
correspondencia en la <I>k</I> -&#233;sima urna.

<P>
Entonces <I>P</I>[<I>A</I><SUB>k</SUB>] es la probabilidad de que ocurra una correspondencia; para el problema del
sombrero, ser&#237;a la probabilidad de que el <EM>k</EM>-&#233;simo hombre obtenga su propio sombrero.

<P>
</LI>
<LI>Para el conteo de posibilidades  de colocar <I>n</I> bolas en
<I>n</I> urnas sea cada punto del espacio muestral un <I>n</I> -tuplo <!-- MATH
 $(x_1,x_2,\dots,x_n)$
 -->
(<I>x</I><SUB>1</SUB>, <I>x</I><SUB>2</SUB>,..., <I>x</I><SUB>n</SUB>), donde <I>x</I><SUB>j</SUB>
representa el n&#250;mero de la bola colocada en la  <I>j</I>-&#233;sima urna. As&#237;, cada componente es
un n&#250;mero de 1 a <I>n</I>, y no existen dos componentes iguales. Entonces si <I>A</I><SUB>k</SUB> es el evento <!-- MATH
 $A_k =
{(x_1,x_2,\dots,x_n) \in \Omega:x_k=k}$
 -->
<I>A</I><SUB>k</SUB> = (<I>x</I><SUB>1</SUB>, <I>x</I><SUB>2</SUB>,..., <I>x</I><SUB>n</SUB>) <IMG
 WIDTH="15" HEIGHT="28" ALIGN="MIDDLE" BORDER="0"
 SRC="img8.gif"
 ALT="$ \in$"> <IMG
 WIDTH="16" HEIGHT="14" ALIGN="BOTTOM" BORDER="0"
 SRC="img9.gif"
 ALT="$ \Omega$">:<I>x</I><SUB>k</SUB>=<I>k</I>. Pruebe que <!-- MATH
 $P[A_k]=1/n$
 -->
<I>P</I>[<I>A</I><SUB>k</SUB>] = 1/<I>n</I>. As&#237;, las probabilidades de
que un hombre obtenga su propio sombrero no depende de que llegue de primero, segundo, o incluso de
&#250;ltimo.

<P>
</LI>
<LI>Pedro y Juan son parte de un grupo de 6 personas
que han colocado su sombrero sobre una mesa. Luego todos seleccionan un sombrero al azar de los
que se encuentran en dicha mesa. Calcule la probabilidad de que:

<OL type="a">
<LI>Pedro obtenga su propio sombrero.
</LI>
<LI>Que tanto Pedro como Juan obtengan sus respectivos
sombreros.
</LI>
<LI>Al menos uno de ellos, o Pedro o Juan, obtenga su propio sombrero.
</LI>
</OL>
<P>
</LI>
<LI>Considere el problema de correspondencia de <I>n</I> urnas y <I>n</I>
bolas numeradas. Muestre que la probabilidad de que al menos haya una correspondencia est&#225; dada
por
<!-- MATH
 \begin{displaymath}
1-\frac{1}{2!}+\frac{1}{3!}-\dots+\frac{(-1)^{n-1}}{n!}\approx1-e^{-1}
=0,632120559.
\end{displaymath}
 -->
<P></P>
<DIV ALIGN="CENTER">
<b>
1 - <IMG
 WIDTH="20" HEIGHT="49" ALIGN="MIDDLE" BORDER="0"
 SRC="img10.gif"
 ALT="$\displaystyle {\frac{1}{2!}}$"> + <IMG
 WIDTH="20" HEIGHT="49" ALIGN="MIDDLE" BORDER="0"
 SRC="img11.gif"
 ALT="$\displaystyle {\frac{1}{3!}}$"> - ... + <IMG
 WIDTH="66" HEIGHT="55" ALIGN="MIDDLE" BORDER="0"
 SRC="img12.gif"
 ALT="$\displaystyle {\frac{(-1)^{n-1}}{n!}}$"> <IMG
 WIDTH="16" HEIGHT="28" ALIGN="MIDDLE" BORDER="0"
 SRC="img13.gif"
 ALT="$\displaystyle \approx$"> 1 - <I>e</I><SUP>-1</SUP> = 0, 632120559</b>.
</DIV>
</LI>
</OL>

</BODY>
</HTML>
