{
  "ecuaciones-diferenciales-orden-superior-2022": {
    "coverImage": "/libros/universitaria/analisis/ecuaciones-diferenciales-orden-superior-2022/portada.webp",
    "title": "Ecuaciones diferenciales de orden superior con apoyo interactivo y videos ilustrativos",
    "title_en": "Higher Order Differential Equations with Interactive Applications and Illustrative Videos",
    "authors": [
      {
        "name": "Norberto Gerardo Oviedo Ugalde",
        "email": "noviedo@itcr.ac.cr",
        "orcid": "https://orcid.org/0000-0003-2167-0196",
        "university": "Instituto Tecnológico de Costa Rica",
        "location": "Costa Rica"
      }
    ],
    "received": "30 de setiembre de 2021",
    "accepted": "25 de enero de 2022",
    "category": "universitaria",
    "pdf": "/libros/universitaria/analisis/ecuaciones-diferenciales-orden-superior-2022/libro.pdf",
    "resources": [
      {
        "type": "zip",
        "label": "Archivos interactivos CDF (requiere Wolfram Player)",
        "url": "/libros/universitaria/analisis/ecuaciones-diferenciales-orden-superior-2022/CDF.zip"
      },
      {
        "type": "link",
        "label": "Descargar Wolfram Player (gratuito)",
        "url": "https://www.wolfram.com/player/"
      }
    ],
    "abstract_es": "El presente libro comprende el estudio de las ecuaciones diferenciales ordinarias de orden superior mediante aspectos teóricos, ejemplos ilustrativos, ejercicios propuestos e incluye enlaces hacia aplicaciones interactivas elaboradas en el software Mathematica y guardadas bajo la versión gratuita Wolfram CDF Player. Estas aplicaciones interactivas son archivos .cdf que se ejecutan con Wolfram CDF Player y requieren estar instaladas en la computadora. Además, se incluyen enlaces directos a videos ilustrativos de ejercicios y ejemplos resueltos relacionados con los temas estudiados en cada sección. El objetivo principal del libro es servir como material teórico-práctico en el estudio de los distintos temas de las ecuaciones diferenciales ordinarias lineales de orden superior (EDOLn), donde las aplicaciones y videos se utilizan como herramienta de apoyo para complementar dicho estudio y comprensión de una manera más dinámica e interactiva.",
    "keywords_es": [
      "ecuaciones diferenciales de orden superior",
      "aplicaciones interactivas",
      "Wolfram CDF"
    ],
    "abstract_en": "This book includes the study of higher-order ordinary differential equations through theoretical aspects, illustrative examples, proposed exercises, and also includes links to interactive applications developed in Mathematica software and saved under the free version of Wolfram CDF Player. These 'interactive applications' are .cdf files that run with Wolfram CDF Player and must be installed on your computer. In addition, the book provides direct links to illustrative videos of exercises and solved examples related to the topics covered in each section. The main objective of the book is to serve as theoretical-practical material for studying the different topics of higher-order linear ordinary differential equations (HODE), where software applications and videos are used as a support tool to complement the study and understanding in a more dynamic and interactive way.",
    "keywords_en": [
      "higher order differential equations",
      "interactive applications",
      "Wolfram CDF"
    ],
    "abstract_pt": "Este livro inclui o estudo das equações diferenciais ordinárias de ordem superior por meio de aspectos teóricos, exemplos ilustrativos, exercícios propostos e também inclui links para aplicações interativas desenvolvidas no software Mathematica e salvas na versão gratuita do Wolfram CDF Player. Essas 'aplicações interativas' são arquivos .cdf que são executados com o Wolfram CDF Player e precisam estar instalados no computador. Além disso, o livro fornece links diretos para vídeos ilustrativos de exercícios e exemplos resolvidos relacionados aos tópicos abordados em cada seção. O principal objetivo do livro é servir como material teórico-prático para o estudo dos diferentes tópicos das equações diferenciais ordinárias lineares de ordem superior (EDOLn), onde as aplicações e vídeos são utilizados como ferramenta de apoio para complementar o estudo e a compreensão de uma forma mais dinâmica e interativa.",
    "keywords_pt": [
      "equações diferenciais de ordem superior",
      "aplicações interativas",
      "Wolfram CDF"
    ],
    "citation": "Oviedo Ugalde, N.G. (2022). Ecuaciones diferenciales de orden superior con apoyo interactivo y videos ilustrativos. Revista digital Matemática, Educación e Internet, 24(1). Recuperado de: https://tecdigital.tec.ac.cr/servicios/revistamatematica/libros/ecuaciones-diferenciales-orden-superior-2022/"
  },
  "calculo-varias-variables-2022": {
    "coverImage": "/libros/universitaria/analisis/calculo-varias-variables-2022/portada.webp",
    "title": "Cálculo en Varias Variables. Visualización interactiva. 2da Ed.",
    "title_en": "Calculus in Several Variables. Interactive Visualization (Wolfram CDFPlayer) 2nd Ed.",
    "authors": [
      {
        "name": "Walter Mora Flores",
        "email": "wmoraz@itcr.ac.cr",
        "orcid": "https://orcid.org/0009-0008-8770-3417",
        "university": "Instituto Tecnológico de Costa Rica, Escuela de Matemática",
        "location": "Costa Rica"
      }
    ],
    "received": "1 de febrero de 2019",
    "accepted": "18 de febrero de 2019",
    "category": "universitaria",
    "lastRevision": "Febrero 2022",
    "pdf": "/libros/universitaria/analisis/calculo-varias-variables-2022/libro.pdf",
    "resources": [
      {
        "type": "zip",
        "label": "Archivos interactivos CDF (requiere Wolfram Player)",
        "url": "/libros/universitaria/analisis/calculo-varias-variables-2022/CDF.zip"
      },
      {
        "type": "link",
        "label": "Descargar Wolfram Player (gratuito)",
        "url": "https://www.wolfram.com/player/"
      }
    ],
    "abstract_es": "El objetivo de este libro es la visualización interactiva en 2D y 3D. La mayoría de los gráficos incluyen un enlace a una aplicación, llamada usualmente 'demostración' (aplicación interactiva), que se ejecuta con Wolfram CDFPlayer (libre). Las aplicaciones interactivas son archivos .cdf que requieren tener instalada la aplicación Wolfram CDFPlayer en la computadora. Esta edición es una versión revisada donde se han optimizado las aplicaciones CDF y se han agregado dos capítulos: Vectores, Rectas y Planos (con coordenadas polares), y Parametrización y Funciones Vectoriales. Muchos de los ejemplos y ejercicios de este libro han sido utilizados en el curso de Cálculo Superior del Instituto Tecnológico de Costa Rica. El lector puede visualizar la teoría y muchos de los ejemplos, e interactuar con las figuras en la aplicación usando el ratón. La idea es visualizar no solo el espacio tridimensional, sino también cortes, intersecciones y proyecciones de una superficie o un sólido en los planos XY, XZ o YZ. Este conocimiento se aplica posteriormente en el cálculo de integrales dobles, triples, de línea y de superficie. Varias aplicaciones interactivas se usan para visualizar la dinámica de una definición o un teorema y su significado. La visualización interactiva funciona bien como complemento y requiere 'narrativa' del profesor para mejores resultados en la enseñanza. También es deseable que el estudiante participe en ejercicios de verbalización en algunas actividades.",
    "keywords_es": [
      "Cálculo en varias variables",
      "integral doble y triple",
      "integral de línea y superficie"
    ],
    "abstract_en": "The goal of this book is interactive visualization in 2D and 3D. Most graphics come with a link to an application, usually called a 'demo' (interactive application), that runs with Wolfram CDFPlayer (free). The interactive applications are .cdf files that require the Wolfram CDFPlayer to be installed on the computer. This is a new revised edition where the CDF applications have been optimized and two chapters have been added: Vectors, Straights and Planes (including polar coordinates), and Parameterization and Vector Functions. Many examples and exercises in this book have been used in the course of Advanced Calculus at the Costa Rica Institute of Technology. The reader can visualize theory and examples, and interact with figures in the application using the mouse. The idea is to visualize not only the three-dimensional space but also cuts, intersections, and projections of a surface or solid in the XY, XZ, or YZ planes. This knowledge is later applied in the calculation of double, triple, line, and surface integrals. Various interactive applications are used to visualize the dynamics of a definition or theorem and its meaning. Interactive visualization works well as a complement and requires 'narrative' from the teacher for better teaching results. Verbalization exercises by the student are also desirable in some activities.",
    "keywords_en": [
      "Calculus in several variables",
      "double and triple integrals",
      "line and surface integrals"
    ],
    "abstract_pt": "O objetivo deste livro é a visualização interativa em 2D e 3D. A maioria dos gráficos inclui um link para uma aplicação, geralmente chamada de 'demonstração' (aplicação interativa), que é executada com o Wolfram CDFPlayer (gratuito). As aplicações interativas são arquivos .cdf que exigem que o Wolfram CDFPlayer esteja instalado no computador. Esta é uma nova edição revisada, na qual as aplicações CDF foram otimizadas e dois capítulos foram adicionados: Vetores, Retas e Planos (incluindo coordenadas polares) e Parametrização e Funções Vetoriais. Muitos dos exemplos e exercícios deste livro foram utilizados no curso de Cálculo Superior do Instituto Tecnológico da Costa Rica. O leitor pode visualizar a teoria e muitos exemplos, e interagir com as figuras na aplicação usando o mouse. A ideia é visualizar não apenas o espaço tridimensional, mas também cortes, interseções e projeções de uma superfície ou sólido nos planos XY, XZ ou YZ. Esse conhecimento é aplicado posteriormente no cálculo de integrais duplas, triplas, de linha e de superfície. Várias aplicações interativas são usadas para visualizar a dinâmica de uma definição ou teorema e seu significado. A visualização interativa funciona bem como complemento e requer 'narrativa' do professor para melhores resultados no ensino. Também é desejável que o aluno participe de exercícios de verbalização em algumas atividades.",
    "keywords_pt": [
      "Cálculo em várias variáveis",
      "integrais duplas e triplas",
      "integrais de linha e de superfície"
    ],
    "citation": "Mora Flores, W. (2022). Cálculo en Varias Variables. Visualización interactiva. 2da Ed. Revista digital Matemática, Educación e Internet, 24(1). Recuperado de: https://tecdigital.tec.ac.cr/servicios/revistamatematica/libros/calculo-varias-variables-2022/"
  },
  "ecuaciones-diferenciales-primer-orden-2022": {
    "coverImage": "/libros/universitaria/analisis/ecuaciones-diferenciales-primer-orden-2022/portada.svg",
    "title": "Ecuaciones diferenciales ordinarias de primer orden con apoyo interactivo y videos ilustrativos",
    "title_en": "First-order ordinary differential equations with interactive support and illustrative videos",
    "authors": [
      {
        "name": "Norberto Gerardo Oviedo Ugalde",
        "email": "noviedo@itcr.ac.cr",
        "orcid": "https://orcid.org/0000-0003-2167-0196",
        "university": "Instituto Tecnológico de Costa Rica",
        "location": "Costa Rica"
      }
    ],
    "received": "26 de febrero de 2019",
    "accepted": "15 de marzo de 2020",
    "category": "universitaria",
    "lastRevision": "Febrero 2022",
    "pdf": "/libros/universitaria/analisis/ecuaciones-diferenciales-primer-orden-2022/libro.pdf",
    "resources": [
      {
        "type": "zip",
        "label": "Archivos interactivos CDF (requiere Wolfram Player)",
        "url": "/libros/universitaria/analisis/ecuaciones-diferenciales-primer-orden-2022/CDF.zip"
      },
      {
        "type": "link",
        "label": "Descargar Wolfram Player (gratuito)",
        "url": "https://www.wolfram.com/player/"
      }
    ],
    "abstract_es": "El presente libro comprende el estudio de las ecuaciones diferenciales ordinarias de primer orden mediante aspectos teóricos, ejemplos ilustrativos y ejercicios propuestos. Asimismo, incluye enlaces hacia aplicaciones de carácter interactivo elaboradas en el software Mathematica y guardadas bajo la versión gratuita Wolfram CDF Player. Estas aplicaciones interactivas son archivos .cdf que se ejecutan con Wolfram CDF Player y requieren estar instaladas en la computadora. Además de las aplicaciones, se incluyen enlaces y códigos QR que llevan a videos ilustrativos de ejercicios y ejemplos resueltos. El objetivo principal del libro es servir como material teórico-práctico en el estudio de los distintos tópicos de las ecuaciones diferenciales ordinarias de primer orden (EDO1), donde las aplicaciones en software y los videos son utilizados como herramientas de apoyo para complementar dicho estudio y entendimiento de una forma más dinámica e interactiva. Este trabajo se divide en seis capítulos que comprenden el estudio de elementos básicos y teoremas de existencia y unicidad, ecuaciones diferenciales en variables separables y homogéneas, ecuaciones diferenciales exactas y con factor integrante, ecuaciones diferenciales lineales de primer orden y de Bernoulli, ecuaciones con variable ausente y cambios de variable, y finalmente un capítulo de ecuaciones diferenciales especiales (Riccati, Lagrange y Clairaut).",
    "keywords_es": [
      "Ecuaciones diferenciales ordinarias",
      "aplicaciones interactivas",
      "Wolfram CDF"
    ],
    "abstract_en": "This book includes the study of first-order ordinary differential equations through theoretical aspects, illustrative examples, and proposed exercises. It also includes links to interactive applications developed in Mathematica software and saved under the free version of Wolfram CDF Player. These interactive applications are .cdf files that run with Wolfram CDF Player and require installation on the computer. In addition to the CDF applications, links and QR codes are included that lead to illustrative videos of exercises and solved examples. The main objective of the book is to serve as theoretical and practical material for the study of different topics of first-order ordinary differential equations (ODE1), where software and video applications are used as support tools to complement the study and understanding in a more dynamic and interactive way. The work is divided into six chapters covering basic elements and theorems of existence and uniqueness, separable and homogeneous differential equations, exact equations with integrating factors, first-order and Bernoulli differential equations, equations with missing variables and change of variables, and finally special differential equations (Riccati, Lagrange, and Clairaut).",
    "keywords_en": [
      "Ordinary differential equations",
      "interactive applications",
      "Wolfram CDF"
    ],
    "abstract_pt": "Este livro compreende o estudo das equações diferenciais ordinárias de primeira ordem por meio de aspectos teóricos, exemplos ilustrativos e exercícios propostos. Também inclui links para aplicações interativas desenvolvidas no software Mathematica e salvas na versão gratuita do Wolfram CDF Player. Essas aplicações interativas são arquivos .cdf que são executados com o Wolfram CDF Player e requerem instalação no computador. Além das aplicações CDF, incluem-se links e códigos QR que levam a vídeos ilustrativos de exercícios e exemplos resolvidos. O principal objetivo do livro é servir como material teórico e prático para o estudo dos diferentes tópicos das equações diferenciais ordinárias de primeira ordem (EDO1), onde aplicações em software e vídeos são utilizadas como ferramentas de apoio para complementar o estudo e a compreensão de forma mais dinâmica e interativa. O trabalho é dividido em seis capítulos que abrangem elementos básicos e teoremas de existência e unicidade, equações diferenciais separáveis e homogêneas, equações exatas com fatores integrantes, equações diferenciais lineares de primeira ordem e de Bernoulli, equações com variável ausente e mudança de variável, e, finalmente, equações diferenciais especiais (Riccati, Lagrange e Clairaut).",
    "keywords_pt": [
      "Equações diferenciais ordinárias",
      "aplicações interativas",
      "Wolfram CDF"
    ],
    "citation": "Oviedo Ugalde, N.G. (2022). Ecuaciones diferenciales ordinarias de primer orden con apoyo interactivo y videos ilustrativos. Revista digital Matemática, Educación e Internet, 24(1). Recuperado de: https://tecdigital.tec.ac.cr/servicios/revistamatematica/libros/ecuaciones-diferenciales-primer-orden-2022/"
  },

  "ecuaciones-diferenciales-transformada-laplace-2021": {
    "coverImage": "/libros/universitaria/analisis/ecuaciones-diferenciales-transformada-laplace-2021/portada.webp",
    "title": "Ecuaciones diferenciales mediante Transformada de Laplace",
    "title_en": "Differential Equations using Laplace Transform",
    "authors": [{
        "name": "Norberto Gerardo Oviedo Ugalde",
        "email": "noviedo@itcr.ac.cr",
        "orcid": "https://orcid.org/0000-0003-2167-0196",
        "university": "Instituto Tecnológico de Costa Rica",
        "location": "Costa Rica"
      }],
    "lastRevision": "Marzo 2021",
    "category": "universitaria ",
    "pdf": "/libros/universitaria/analisis/ecuaciones-diferenciales-transformada-laplace-2021/libro.pdf",
    "resources": [
      {
        "type": "zip",
        "label": "Archivos interactivos CDF (requiere Wolfram Player)",
        "url": "/libros/universitaria/analisis/ecuaciones-diferenciales-transformada-laplace-2021/CDF.zip"
      },
      {
        "type": "link",
        "label": "Descargar Wolfram Player (gratuito)",
        "url": "https://www.wolfram.com/player/"
      }
    ],
    "abstract_es": "Este material didáctico introduce al lector en el estudio de las ecuaciones diferenciales ordinarias mediante el uso de la Transformada de Laplace, apoyándose en recursos interactivos desarrollados en Mathematica y distribuidos en formato Wolfram CDF (Computable Document Format). Su propósito principal es servir como apoyo dinámico y visual para la enseñanza y el aprendizaje de este tema, permitiendo explorar de forma práctica los principales teoremas asociados: los teoremas de traslación, el teorema de convolución y las transformadas de derivadas, junto con sus formas inversas. El libro incluye además aplicaciones interactivas que ilustran la resolución de ecuaciones diferenciales, integrales e integro-diferenciales con coeficientes constantes, promoviendo una comprensión más profunda de los métodos analíticos y computacionales de la Transformada de Laplace.",
    "keywords_es": [
      "Transformada de Laplace",
      "ecuaciones diferenciales",
      "aplicaciones interactivas",
      "Mathematica",
      "Wolfram CDF"
    ],
    "abstract_en": "This didactic material introduces the reader to the study of ordinary differential equations using the Laplace Transform, supported by interactive resources developed in Mathematica and distributed in Wolfram CDF (Computable Document Format). Its main purpose is to serve as a dynamic and visual aid for the teaching and learning of this topic, allowing practical exploration of the main associated theorems: the first and second shifting theorems, the convolution theorem, and the transforms of derivatives, along with their inverse forms. The book also includes interactive applications that illustrate the solution of differential, integral, and integro-differential equations with constant coefficients, fostering a deeper understanding of the analytical and computational methods of the Laplace Transform.",
    "keywords_en": [
      "Laplace Transform",
      "differential equations",
      "interactive applications",
      "Mathematica",
      "Wolfram CDF"
    ],
    "abstract_pt": "Este material didático introduz o leitor ao estudo das equações diferenciais ordinárias utilizando a Transformada de Laplace, apoiando-se em recursos interativos desenvolvidos no Mathematica e distribuídos no formato Wolfram CDF (Computable Document Format). Seu principal objetivo é servir como um apoio dinâmico e visual para o ensino e a aprendizagem deste tema, permitindo explorar de forma prática os principais teoremas associados: os teoremas de translação, o teorema de convolução e as transformadas de derivadas, juntamente com suas formas inversas. O livro também inclui aplicações interativas que ilustram a resolução de equações diferenciais, integrais e integro-diferenciais com coeficientes constantes, promovendo uma compreensão mais profunda dos métodos analíticos e computacionais da Transformada de Laplace.",
    "keywords_pt": [
      "Transformada de Laplace",
      "equações diferenciais",
      "aplicações interativas",
      "Mathematica",
      "Wolfram CDF"
    ],
    "citation": "Oviedo Ugalde, N.G. (2021). Ecuaciones diferenciales mediante Transformada de Laplace. Revista digital Matemática, Educación e Internet, 23(1). Recuperado de: https://tecdigital.tec.ac.cr/servicios/revistamatematica/libros/ecuaciones-diferenciales-transformada-laplace-2021/"
  },
  "ecuaciones-diferenciales-orden-superior-2020": {
    "coverImage": "/libros/universitaria/analisis/ecuaciones-diferenciales-orden-superior-2020/portada.webp",
    "title": "Ecuaciones diferenciales de orden superior",
    "title_en": "Higher Order Differential Equations",
    "authors": ["Norberto Oviedo U."],
    "lastRevision": "Marzo 2020",
    "category": "universitaria ",
    "pdf": "/libros/universitaria/analisis/ecuaciones-diferenciales-orden-superior-2020/libro.pdf",
    "resources": [
      {
        "type": "zip",
        "label": "Archivos interactivos CDF (requiere Wolfram Player)",
        "url": "/libros/universitaria/analisis/ecuaciones-diferenciales-orden-superior-2020/CDF.zip"
      },
      {
        "type": "link",
        "label": "Descargar Wolfram Player (gratuito)",
        "url": "https://www.wolfram.com/player/"
      }
    ]
  },
  "ecuaciones-diferenciales-primer-orden-2018": {
    "coverImage": "/libros/universitaria/analisis/ecuaciones-diferenciales-primer-orden-2018/portada.webp",
    "title": "Ecuaciones diferenciales ordinarias de 1er orden",
    "title_en": "First Order Ordinary Differential Equations",
    "authors": ["Norberto Oviedo U."],
    "lastRevision": "2018",
    "category": "universitaria ",
    "pdf": "/libros/universitaria/analisis/ecuaciones-diferenciales-primer-orden-2018/libro.pdf",
    "resources": [
      {
        "type": "zip",
        "label": "Archivos interactivos CDF (requiere Wolfram Player)",
        "url": "/libros/universitaria/analisis/ecuaciones-diferenciales-primer-orden-2018/CDF.zip"
      },
      {
        "type": "link",
        "label": "Descargar Wolfram Player (gratuito)",
        "url": "https://www.wolfram.com/player/"
      }
    ]
  },

  "vectores-rectas-y-planos-2018": {
    "coverImage": "/libros/universitaria/geometria/vectores-rectas-y-planos-2018/portada.webp",
    "title": "Vectores, Rectas y Planos. Visualización interactiva",
    "title_en": "Vectors, Lines and Planes. Interactive Visualization",
    "authors": [
      {
        "name": "Marco Gutiérrez M.",
        "orcid": "https://orcid.org/0009-0004-0293-1578",
        "university": "Instituto Tecnológico de Costa Rica, Escuela de Matemática",
        "email": "",
        "location": "Costa Rica"
      },
      {
        "name": "Walter Mora F.",
        "email": "wmoraz@itcr.ac.cr",
        "orcid": "https://orcid.org/0009-0008-8770-3417",
        "university": "Instituto Tecnológico de Costa Rica, Escuela de Matemática",
        "location": "Costa Rica"
      }
    ],
    "doi": "https://doi.org/10.18845/rdmei.v19i1.3856",
    "received": "Marzo 2018",
    "accepted": "Abril 2018",
    "category": "universitaria",
    "lastRevision": "Abril 2018",
    "pdf": "/libros/universitaria/geometria/vectores-rectas-y-planos-2018/libro.pdf",
    "resources": [
      {
        "type": "zip",
        "label": "Archivos interactivos CDF (requiere Wolfram Player)",
        "url": "/libros/universitaria/geometria/vectores-rectas-y-planos-2018/CDF.zip"
      },
      {
        "type": "link",
        "label": "Descargar Wolfram Player (gratuito)",
        "url": "https://www.wolfram.com/player/"
      }
    ],
    "abstract_es": "El objetivo de este libro es la visualización interactiva en 2D y en 3D. La mayoría de las figuras incluyen un enlace a una aplicación llamada 'demostración' (aplicación interactiva), que se ejecuta con Wolfram CDFPlayer (gratuito). Las 'aplicaciones interactivas' son archivos .cdf que requieren tener instalada en la computadora dicha aplicación. Varias aplicaciones interactivas se utilizan para visualizar la dinámica de una definición o de un teorema y su significado. Como es conocido, la visualización interactiva funciona bien como complemento y requiere 'narrativa' por parte del profesor para obtener buenos resultados en la enseñanza. También se recomienda la realización de ejercicios de verbalización, en algunas actividades, por parte del estudiante.",
    "keywords_es": [
      "Visualización interactiva",
      "vectores",
      "rectas",
      "planos"
    ],
    "abstract_en": "The objective of this book is interactive visualization in 2D and 3D. Most figures include a link to an application, usually called a 'demo' (interactive application), that runs with Wolfram CDFPlayer (free). The 'interactive applications' are .cdf files that require this application to be installed on the computer. Various interactive applications are used to visualize the dynamics of a definition or theorem and its meaning. As is known, interactive visualization works well as a complement and requires 'narration' by the teacher to achieve good teaching results. Verbalization exercises by the student are also desirable in some activities.",
    "keywords_en": ["Interactive visualization", "vectors", "lines", "planes"],
    "abstract_pt": "O objetivo deste livro é a visualização interativa em 2D e 3D. A maioria das figuras inclui um link para uma aplicação chamada 'demonstração' (aplicação interativa), que é executada com o Wolfram CDFPlayer (gratuito). As 'aplicações interativas' são arquivos .cdf que exigem que o aplicativo Wolfram CDFPlayer esteja instalado no computador. Várias aplicações interativas são usadas para visualizar a dinâmica de uma definição ou teorema e seu significado. Como se sabe, a visualização interativa funciona bem como complemento e requer 'narrativa' por parte do professor para obter bons resultados no ensino. Também são recomendados exercícios de verbalização, em algumas atividades, por parte do aluno.",
    "keywords_pt": ["Visualização interativa", "vetores", "retas", "planos"],
    "citation": "Gutiérrez, M., & Mora, W. (2018). Vectores, Rectas y Planos. Visualización interactiva. Revista digital Matemática, Educación e Internet, 19(1). Instituto Tecnológico de Costa Rica. DOI: https://doi.org/10.18845/rdmei.v19i1.3856"
  }
}
