<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<meta name="GENERATOR" content="Microsoft FrontPage 4.0">
<meta name="ProgId" content="FrontPage.Editor.Document">
<title>Soluci&oacute;n</title>
</head>

<body>

      <table CELLSPACING="0" BORDER="0" WIDTH="100%">
        <tr>
          <td WIDTH="1" VALIGN="TOP" BGCOLOR="#ffffff" HEIGHT="1">&nbsp;
            <p>&nbsp;</td>
          <td WIDTH="100%" VALIGN="TOP" BGCOLOR="#ffffff"><br>
            I<small>NSTITUTO </small>T<small>ECNOL&Oacute;GICO DE </small>C<small>OSTA
            </small>R<small>ICA.</small><br>
            E<small>SCUELA DE </small>M<small>ATEM&Aacute;TICA</small>
            <p>&nbsp;
            <div ALIGN="CENTER">
              <font SIZE="+2">PRIMER EXAMEN PARCIAL</font><br>
              Probabilidades<br>
              II S<small>EMESTRE DEL 2000</small>
            </div>
            <p>Tiempo: 2 Horas 15 Minutos&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            Puntaje M&aacute;ximo 39 Puntos<br>
            <p>T<small>RABAJE DE FORMA CLARA Y ORDENADA. </small>J<small>USTIFIQUE
            DEBIDAMENTE CADA RESPUESTA. </small>U<small>SE BOL&Iacute;GRAFO,&nbsp;
            EN CASO
            DE TRABAJAR CON L&Aacute;PIZ,&nbsp; NO SE ACEPTAN APELACIONES.</small>
            <p>&nbsp;
            <ol>
              <li>Se lanzan dos dados y se observa como variable aleatoria, la
                suma de los resultados de los dos dados. Si los dados est&aacute;n
                cargados y los pares tienen el doble de opci&oacute;n de salir que los
                impares, determine la probabilidad de:
                <p>&nbsp;
                <ol>
                  <li>Que al lanzar los dos dados una vez la suma de las caras
                    obtenidas sea igual a cinco. (2)
                    <p>&nbsp;</li>
                  <li>Obtener una suma de cinco entre los dos dados durante 4
                    veces si el par de dados se lanzan durante 8 veces. (3)
                    <p>&nbsp;</li>
                  <li>Obtener una suma de cinco entre los dos dados durante el
                    tercer y quinto lanzamiento si se lanzan 8 veces los dados.
                    (2)
                    <p>&nbsp;</li>
                  <li>Adem&aacute;s determine la distribuci&oacute;n de probabilidad de la variable
                    aleatoria <i>X</i>, <em>el n&uacute;mero de veces que hay que
                    tirar dos dados cargados hasta obtener alguno de los pares</em><br>
                    <!-- MATH
 $(1,1)(2,2)(3,3)(4,4)(5,5)(6,6)$
 -->
                    (1, 1)(2, 2)(3, 3)(4, 4)(5, 5)(6, 6). (3)
                    <p>&nbsp;</li>
                </ol>
                <p>&nbsp;</li>
              <li>Una empresa est&aacute; organizando una actividad para el d&iacute;a de
                las madres a la cual se asistir&aacute;n 12 se&ntilde;oras.
                <ol>
                  <li>Si se toma en cuenta el orden en el cual se entregan las
                    invitaciones, ¿de cu&aacute;ntas maneras se pueden entregar.?
                    (1)
                    <p>&nbsp;</li>
                  <li>Se van a repartir 18 rosas idénticas entre las madres. ¿
                    De cu&aacute;ntas maneras se puede hacer la repartici&oacute;n de
                    forma tal que la Se&ntilde;ora L&oacute;pez reciba a lo sumo tres rosas,
                    la Se&ntilde;ora Vega reciba exactamente tres rosas y todas las
                    invitadas reciban al menos una rosa. (3)
                    <p>&nbsp;</li>
                  <li>Se tienen 4 canastas iguales de productos de belleza, 5
                    perfumes iguales y 3 regalos sorpresa iguales. Si se
                    reparten en forma aleatoria, un regalo por invitada, ¿de cu&aacute;ntas
                    maneras quedan distribuidos estos regalos (2)?
                    <p>&nbsp;</li>
                </ol>
                <p>&nbsp;</li>
              <li>Se disponen de 3 cajas con esferas de diferentes colores
                distribuidas de la siguiente manera:
                <p>&nbsp;
                <div ALIGN="CENTER">
                  <table CELLPADDING="3" BORDER="1">
                    <tr>
                      <td ALIGN="CENTER">CAJA 1</td>
                      <td ALIGN="CENTER">CAJA 2</td>
                      <td ALIGN="CENTER">CAJA 3</td>
                    </tr>
                    <tr>
                      <td ALIGN="CENTER">&nbsp;</td>
                      <td ALIGN="CENTER">&nbsp;</td>
                      <td ALIGN="CENTER">11 amarillas</td>
                    </tr>
                    <tr>
                      <td ALIGN="CENTER">10 rojas</td>
                      <td ALIGN="CENTER">8 verdes</td>
                      <td ALIGN="CENTER">4 rojas</td>
                    </tr>
                    <tr>
                      <td ALIGN="CENTER">4 blancas</td>
                      <td ALIGN="CENTER">3 blancas</td>
                      <td ALIGN="CENTER">2 blancas</td>
                    </tr>
                  </table>
                </div>
                <p>Considere el experimento que consiste en:
                <ul>
                  <li>Se selecciona una esfera de la caja 1, sin reposici&oacute;n.</li>
                  <li>Si la esfera seleccionada es blanca, se extrae otra esfera
                    de la caja 1 y se pasa a la caja 2.
                    <p>&nbsp;</li>
                  <li>Si la esfera seleccionada es roja, se extraen otras 2
                    esferas de la caja 1 y se pasan a la caja 3.</li>
                </ul>
                Si se hace una selecci&oacute;n de la caja que recibi&oacute; la
                transferencia,
                <p>Determine:
                <p>&nbsp;
                <ol>
                  <li>La probabilidad de obtener una esfera roja. (3)
                    <p>&nbsp;</li>
                  <li>Dado que se seleccion&oacute; una bola roja, determine la
                    probabilidad de que se hayan transferido dos esferas desde
                    la caja 1 a la caja tres. (3)</li>
                </ol>
                <p>&nbsp;</li>
              <li>Siete terminales de un sistema est&aacute;n conectadas por una l&iacute;nea
                de comunicaci&oacute;n a un centro de c&oacute;mputo. En un tiempo espec&iacute;fico,
                exactamente cuatro de las siete terminales est&aacute;n listas para
                transmitir un mensaje. Asuma que cada terminal tiene la misma
                probabilidad de ser consultada y tome <i>X</i>, la variable
                aleatoria que indica el n&uacute;mero de terminales que deben ser
                consultadas hasta obtener una terminal lista para transmitir.
                <ol>
                  <li>Determine los posibles valores para <i>X</i> y la
                    distribuci&oacute;n de probabilidad para <i>X</i>. (3)</li>
                  <li>Si en el problema si tienen <i>m</i> terminales de las
                    cuales hay <i>n</i> listas, ¿cu&aacute;l es la distribuci&oacute;n de
                    probabilidad para X, el n&uacute;mero de terminales que deben ser
                    consultadas hasta obtener una terminal lista para
                    transmitir. ? (3)
                    <p>&nbsp;</li>
                </ol>
              </li>
              <li>Una tienda que vende suministros de c&oacute;mputo vende dos tipos
                de discos compactos, el normal y otro tipo llamado extra. El 70%
                de los clientes de la tienda buscan el tipo extra.
                <p>&nbsp;
                <ol>
                  <li>Entre 10 clientes seleccionados al azar, que desean
                    comprar un disco, ¿cu&aacute;l es la probabilidad de que por lo
                    menos 5 clientes busquen el tama&ntilde;o extra.? (3)
                    <p>&nbsp;</li>
                  <li>Si en la tienda hay en este momento 5 discos de cada tipo.
                    ¿Cu&aacute;l es la probabilidad de que los pr&oacute;ximos 10
                    clientes que busquen un disco puedan comprar lo que desean?
                    (2)&nbsp;&nbsp;</li>
                </ol>
                <p>&nbsp;
              </li>
              <li>De una poblaci&oacute;n de 500 animales se capturan 200, se marcan y
                se sueltan para que vuelvan a mezclarse con el resto de la
                poblaci&oacute;n.
                <ol>
                  <li>Calcule la probabilidad de que en una muestra de 20
                    animales capturados o recapturados haya 4 o menos marcados.
                    (3)</li>
                  <li>Cu&aacute;l es la probabilidad de que aparezcan 4 o m&aacute;s
                    animales marcados en una captura o recaptura de 20. (3)</li>
                </ol>
                <p>&nbsp;
              </li>
            </ol>
          </td>
        </tr>
      </table>

</body>

</html>
